{
  "title": "Why are you using embedded mode of mod_wsgi?",
  "content": "If you are using [Apache/mod\\_wsgi](http://www.modwsgi.org/) and when you set it up all you cared about was getting something working, but didn't care much for understanding how things worked and how you should set it up, chances are you are running your WSGI application in embedded mode of mod\\_wsgi. If you don't understand how to setup Apache, using embedded mode is nearly always a bad idea. Much more so if the Apache installation you are using is the default installation offered up by many Linux distributions, because in that case you are likely running the Apache prefork MPM, a choice which only compounds the problems you can experience.  \n  \nThe preferred mode of running a WSGI application under mod\\_wsgi if you have no idea of how to setup and tune Apache to match your specific web application, is daemon mode. Even if you reckon you do know how to setup Apache it is still safer to use daemon mode.  \n  \n\n\n####  If daemon mode is a better option, why isn't it the default?\n\n  \nThis unfortunate situation whereby embedded mode is the default came about because in the very first incarnation of mod\\_wsgi it was designed to mimic what mod\\_python did. As a result, it only supported the concept of embedded mode. This is where the WSGI application runs within the actual Apache child processes, the same processes which are also handling serving of static file requests.  \n  \nAlthough daemon mode, which is more akin to how FASTCGI works with the WSGI application running in separate dedicated processes, was added later, embedded mode was already the default and it was hard to change at that point. Daemon mode also needed additional configuration whereas with embedded mode, things would at least run out of the box. Under Windows only embedded mode is supported, so having daemon mode be the default on UNIX systems but embedded mode the default on Windows was also seen as confusing.  \n  \n\n\n####  Why is running in embedded mode so bad?\n\n  \nThe problems with embedded mode aren't so much due to the fact that the WSGI application is running in the actual Apache child processes, but that management of the processes is done by Apache and as such is subject to the general MPM settings of Apache. For the typical default Apache configuration the MPM settings are set up for serving of static files. The settings are not necessarily going to work very well for a dynamic web application with a large memory footprint that performs better when kept persistent in memory, as is the case for the majority of Python web applications.  \n  \nPHP gets away with running okay within the Apache child processes because of how PHP was designed to work. Specifically in PHP, any application code is effectively reloaded on each request and so it has been optimised in various ways to perform adequately under that scenario. Python being a general purpose programming language adapted to run web applications has a much larger startup cost for both the interpreter and for loading up a web application. Certain aspects of how the Python interpreter is implemented and loading of Python modules managed, also means it is not possible to use some of the techniques that PHP uses around preloading of the interpreter and code modules prior to forking of the Apache child processes. Python in Apache can simply therefore never match PHPs efficiency in this respect.  \n  \nThe big problem therefore is simply the default configuration. If the MPM settings are properly setup and tuned for your specific Python web application running under embedded mode, then embedded mode will perform better than daemon mode. Use the default settings or don't configure it properly and you risk setting yourself up for a world of hurt.  \n  \n\n\n####  How should embedded mode be configured?\n\n  \n\n\nHow best to configure the MPM settings of Apache when running a WSGI application in embedded mode is not the point of this post. I will deal with that another time. The point of this post is to help you identify when you are running embedded mode and show you how to setup daemon mode in its basic configuration instead. You can at least then shift away from using embedded mode if you didn't even realise you were using it and avoid causing problems for yourself.  \n  \n\n\n####  Determining if embedded mode is being used.\n\n  \nTo determine if your WSGI application is running in embedded mode, replace its WSGI script with the test WSGI script as follows:  \n  \n  \nimport sys  \n  \ndef application\\(environ, start\\_response\\):  \nstatus = '200 OK'  \n  \nname = repr\\(environ\\['mod\\_wsgi.process\\_group'\\]\\)  \noutput = 'mod\\_wsgi.process\\_group = %s' % name   \n  \nresponse\\_headers = \\[\\('Content-type', 'text/plain'\\),  \n\\('Content-Length', str\\(len\\(output\\)\\)\\)\\]  \nstart\\_response\\(status, response\\_headers\\)  \n  \nreturn \\[output\\]  \n  \n  \n  \nIf the configuration is such that the WSGI application is running in embedded mode, then you will see:  \n  \nmod\\_wsgi.process\\_group = ''  \n  \n  \nThat is, the process group definition will be an empty string.  \n  \nIf instead you are already running in the preferred daemon mode, you would see a non empty string giving the name of the daemon process group.  \n  \n\n\n####  Identifying which Apache MPM you are using.\n\n  \n\n\nEven if your WSGI application is running in daemon mode, if the only thing you are using Apache for is to host the WSGI application and serve static files, then it is also recommended that you use worker MPM rather than prefork MPM as worker MPM will cut down on memory use by the Apache child processes.\n\n  \n\n\nTo determine if you are using prefork MPM or worker MPM, you could try and work it out by looking at what operating system packages are installed, but the definitive way of doing it, is to run the Apache binary with the '-V' option.\n\n  \n\n\n$ /usr/sbin/httpd -V\n\nServer version: Apache/2.2.14 \\(Unix\\)\n\nServer built: Feb 10 2010 22:22:39\n\nServer's Module Magic Number: 20051115:23\n\nServer loaded: APR 1.3.8, APR-Util 1.3.9\n\nCompiled using: APR 1.3.8, APR-Util 1.3.9\n\nArchitecture: 64-bit\n\nServer MPM: Prefork\n\nthreaded: no\n\nforked: yes \\(variable process count\\)\n\nServer compiled with....\n\n-D APACHE\\_MPM\\_DIR=\"server/mpm/prefork\"\n\n-D APR\\_HAS\\_SENDFILE\n\n-D APR\\_HAS\\_MMAP\n\n-D APR\\_HAVE\\_IPV6 \\(IPv4-mapped addresses enabled\\)\n\n-D APR\\_USE\\_FLOCK\\_SERIALIZE\n\n-D APR\\_USE\\_PTHREAD\\_SERIALIZE\n\n-D SINGLE\\_LISTEN\\_UNSERIALIZED\\_ACCEPT\n\n-D APR\\_HAS\\_OTHER\\_CHILD\n\n-D AP\\_HAVE\\_RELIABLE\\_PIPED\\_LOGS\n\n-D DYNAMIC\\_MODULE\\_LIMIT=128\n\n-D HTTPD\\_ROOT=\"/usr\"\n\n-D SUEXEC\\_BIN=\"/usr/bin/suexec\"\n\n-D DEFAULT\\_PIDLOG=\"/private/var/run/httpd.pid\"\n\n-D DEFAULT\\_SCOREBOARD=\"logs/apache\\_runtime\\_status\"\n\n-D DEFAULT\\_LOCKFILE=\"/private/var/run/accept.lock\"\n\n-D DEFAULT\\_ERRORLOG=\"logs/error\\_log\"\n\n-D AP\\_TYPES\\_CONFIG\\_FILE=\"/private/etc/apache2/mime.types\"\n\n-D SERVER\\_CONFIG\\_FILE=\"/private/etc/apache2/httpd.conf\"\n\n  \n\n\nThe 'Server MPM' field will tell you which MPM your Apache has been compiled for.\n\n  \n\n\nIf for some reason you can't work out which is the Apache binary, because your Linux distribution calls it something other than 'httpd', or they have modified it so it will not run unless some magic environment variables are set, then you can also guess what is running by using the following WSGI script.\n\n  \n\n\nimport sys\n\n  \n\n\ndef application\\(environ, start\\_response\\):\n\nstatus = '200 OK'\n\noutput = 'wsgi.multithread = %s' % repr\\(environ\\['wsgi.multithread'\\]\\)\n\n  \n\n\nresponse\\_headers = \\[\\('Content-type', 'text/plain'\\),\n\n\\('Content-Length', str\\(len\\(output\\)\\)\\)\\]\n\nstart\\_response\\(status, response\\_headers\\)\n\n  \n\n\nreturn \\[output\\]\n\n  \n\n\nIf you get the output:\n\n  \n\n\nwsgi.multithread = True\n\n  \n\n\nyou are likely running worker MPM and otherwise are running prefork MPM.\n\n  \n\n\n####  Running a WSGI application in daemon mode.\n\n  \n\n\nTo force a WSGI application to run in daemon mode, the WSGIDaemonProcess and WSGIProcessGroup directives would need to be defined. For example, to setup a daemon process group containing two multithreaded processes one could use:\n\n  \n\n\nWSGIDaemonProcess example.com processes=2 threads=15\n\nWSGIProcessGroup example.com\n\n  \n\n\nThe WSGIDaemonProcess directive specifies the details of the daemon process group. The WSGIProcessGroup indicates that any WSGI application specified within the same context is to be delegated to run in that daemon process group.\n\n  \n\n\nA complete virtual host configuration for this type of setup would therefore be something like:\n\n  \n\n\n<VirtualHost \\*:80>\n\n  \n\n\nServerName www.example.com\n\nServerAlias example.com\n\nServerAdmin webmaster@example.com\n\n  \n\n\nDocumentRoot /usr/local/www/documents\n\n  \n\n\nAlias /robots.txt /usr/local/www/documents/robots.txt\n\nAlias /favicon.ico /usr/local/www/documents/favicon.ico\n\n  \n\n\nAlias /media/ /usr/local/www/documents/media/\n\n  \n\n\n<Directory /usr/local/www/documents>\n\nOrder allow,deny\n\nAllow from all\n\n</Directory>\n\n  \n\n\nWSGIDaemonProcess example.com processes=2 threads=15 display-name=%\\{GROUP\\}\n\nWSGIProcessGroup example.com\n\n  \n\n\nWSGIScriptAlias / /usr/local/www/wsgi-scripts/myapp.wsgi\n\n  \n\n\n<Directory /usr/local/www/wsgi-scripts>\n\nOrder allow,deny\n\nAllow from all\n\n</Directory>\n\n  \n\n\n</VirtualHost>\n\n  \n\n\nAfter appropriate changes have been made Apache will need to be restarted. For this example, the URL 'http://www.example.com/' would then be used to access the the WSGI application.\n\n  \n\n\nNote that you obviously should substitute the paths and hostname with values appropriate for your system.\n\n  \n\n\nAfter making the changes, use the test WSGI script described before to verify the WSGI application is in fact running in daemon mode. It is a common mistake to see people use WSGIDaemonProcess but then not use WSGIProcessGroup or other configuration mechanisms to ensure that the WSGI application is in fact delegated to the daemon process group, so double check you got the configuration correct.\n\n  \n\n\n  \n\n\n####  Immediate benefits of using daemon mode.\n\n  \n\n\nWhen you use daemon mode, the number of processes and threads is static. This is one of the immediate benefits of using daemon mode. Specifically, that process management is more predictable. One of the big problems with using embedded mode is that Apache can decide to create additional processes or kill off existing ones. For a web application with large startup costs this is not a good idea as you could suddenly see increased CPU usage due to more processes being started right at the time you don't need it such as when a throughput spike occurs. This can actually cause performance to degrade in the short term rather than improve.\n\n  \n\n\nIf using embedded mode and you need to update the code for your Python web application, you have no choice but to restart the whole of Apache. If using daemon mode, you can avoid restarting the whole of Apache and can instead simply touch the WSGI script file to update its modification date. This will have the side effect of causing the daemon processes to restart on the next request. This is also convenient when using Apache/mod\\_wsgi as a development environment to ensure parity with your production environment.\n\n  \n\n\n####  Additional reference documentation.\n\n  \n\n\nThe information above gives a quick heads up on how to check whether you are running in embedded mode and how instead to get your WSGI application running in daemon mode. For additional information also read:\n\n  * [Quick Configuration Guide](http://code.google.com/p/modwsgi/wiki/QuickConfigurationGuide)\n  * [Checking Your Installation](http://code.google.com/p/modwsgi/wiki/CheckingYourInstallation)\n  * [Processes And Threading](http://code.google.com/p/modwsgi/wiki/ProcessesAndThreading)\n  * [Reloading Source Code](http://code.google.com/p/modwsgi/wiki/ReloadingSourceCode)\n\n\n\nRelated blog posts which would be worthwhile reading are:\n\n  * [Save on memory with mod\\_wsgi 3.0.](/posts/2009/11/save-on-memory-with-modwsgi-30/)\n\n\n\nThe most up to date version of mod\\_wsgi 3.4. This was only released recently and the majority of distributions will not as yet have it as a packaged binary. You should at least aim to use mod\\_wsgi 3.3. If you are on a Linux distribution which is still only supplying mod\\_wsgi 2.8 or older, you really should think about upgrading to a more modern operating system distribution as 2.8 was released almost 3 years ago.",
  "date": "Saturday, October 13, 2012",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html",
  "post_id": "6192669448750283967",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "4140416943369592800",
      "author": "Marius Gedminas",
      "author_url": "https://www.blogger.com/profile/15155998626202067226",
      "author_profile_id": "15155998626202067226",
      "content": "Speaking of WSGIProcessGroup, is the order important? In other words, if I have a WSGIScriptAlias directive above the WSGIDaemonProcess and WSGIProcessGroup directives inside the same , will they apply to that WSGIScriptAlias?",
      "timestamp": "October 15, 2012 at 8:45 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1350294343021#c4140416943369592800",
      "is_blog_author": false
    },
    {
      "comment_id": "2270843103021110951",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "The only ordering issue is that if you have multiple WSGIProcessGroup directives in the same scope, the last one will be used. In other words, determined by scope and last one encountered for that scope is used.  \n  \nFurther, if you have a nested scope, any defined in the nested scope overrides that in the parent scope. Thus if you have WSGIProcessGroup at VirtualHost scope and then also set WSGIProcessGroup inside of a Location or Directory context, and a specific request matches in some way that nested context, the WSGIProcessGroup from that nested context is used instead.  \n  \nThis means for example you could have two WSGIDaemonProcess directives for different named groups. You might have default WSGIProcessGroup at VirtualHost context select one of them, but then for a specific URL subset, use Location and a nested WSGIProcessGroup to override that requests in that case go to the other daemon process group.  \n  \nSuch a mechanism might be used if some subset of URLs used a C extension module for Python which wasn't thread safe. The default daemon process group could be default single process and multithreaded \\(thus less memory\\) and the second daemon process group could be a couple of single threaded processes.  \n  \nSo have flexibility to segment parts of an application by URLs using Location directive across multiple daemon process groups, each configured differently to suite the requirements for those URLs.",
      "timestamp": "October 15, 2012 at 9:10 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1350295835357#c2270843103021110951",
      "is_blog_author": true
    },
    {
      "comment_id": "8967871582326876700",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/02501649807440727382",
      "author_profile_id": "02501649807440727382",
      "content": "Just a minor point, I am using embedded mode \\(I don't have the daemon directives, and I also double checked using the checking wsgi\\_app given\\). Nonetheless, when I change my python code, the changes are immediately visible - without restarting apache \\(in the post it is asserted that you only get this behaviour in daemon mode\\).",
      "timestamp": "August 9, 2013 at 11:47 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1376012832346#c8967871582326876700",
      "is_blog_author": false
    },
    {
      "comment_id": "5968949763035034793",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Michael Are you sure the next request isn't just being picked up by a different Apache child worker process that hasn't loaded your code yet? Depending on your Apache MPM configuration, Apache can recycle processes that are idle and so easily give this impression. In embedded mode, mod\\_wsgi by itself definitely doesn't reload the whole process automatically under any circumstances. The only way you would get it is by the separate code on mod\\_wsgi site which checks for changes from a background thread and kills the processes when such changes are detected, something which I wouldn't recommend in embedded mode if other stuff is running in the same Apache, such as static file serving or PHP applications etc. Anyway, all details of how reloading works is documented in http://code.google.com/p/modwsgi/wiki/ReloadingSourceCode",
      "timestamp": "August 19, 2013 at 11:20 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1376875217393#c5968949763035034793",
      "is_blog_author": true
    },
    {
      "comment_id": "3879154429802113229",
      "author": "Dan",
      "author_url": "https://www.blogger.com/profile/13276536901373475090",
      "author_profile_id": "13276536901373475090",
      "content": "Hmm, I ran the daemon vs embedded test, and got a process group back, which I assume means I'm running this as a daemon \\(with apache prefork, though\\). However, I notice that only some changes seem to be immediately reflected upon reload of a webpage without an apache restart.   \n  \nFor example, css changes \\(in my static folder\\) seem to get picked up, but changes to my templates don't \\(I'm using bottle + jinja2, so I've got a views folder with templates inside it\\).   \n  \nIs this behavior expected? I would think/hope there's a way to get these changes to be picked up. Am I just missing some other point?",
      "timestamp": "February 26, 2014 at 2:27 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1393385255709#c3879154429802113229",
      "is_blog_author": false
    },
    {
      "comment_id": "3403637905299124565",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "Python will cache all code in the process and doesn't automatically reload code after it has changed. Whether templates are reloaded automatically can depend on the web framework being used or how you wrote your code. Read http://code.google.com/p/modwsgi/wiki/ReloadingSourceCode on details of how to trigger reloading.",
      "timestamp": "February 26, 2014 at 2:31 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1393385511144#c3403637905299124565",
      "is_blog_author": true
    },
    {
      "comment_id": "8565131516184842765",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/02501649807440727382",
      "author_profile_id": "02501649807440727382",
      "content": "I'm having no luck with configured daemon mode on my prefork single threaded apache2 installation \\(after several attempts\\). Hence I'd like to optimize my embedded mode - you mention that this is an appropriate approach, and that you'd write about how to do it elsewhere. Is there some reference you can point me to about the best apache configuration for embedded mode? Thanks for your work\\!",
      "timestamp": "June 17, 2014 at 5:17 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1402989420671#c8565131516184842765",
      "is_blog_author": false
    },
    {
      "comment_id": "7349952045373840278",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Michael If you need help there is the mod\\_wsgi mailing list. Comments on blog posts are not the appropriate place for debugging problems. I would very much suggest you use that list to resolve your issues with your daemon mode configuration before giving up on it.  \n  \nYou can find details at:  \n  \nhttp://code.google.com/p/modwsgi/wiki/WhereToGetHelp?tm=6\\#Asking\\_Your\\_Questions  \n  \nIf you are still adamant that you want to use prefork MPM instead, then I can provide links to material for you to look through when you post on the list.",
      "timestamp": "June 17, 2014 at 5:22 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1402989730403#c7349952045373840278",
      "is_blog_author": true
    },
    {
      "comment_id": "5139037046971070548",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/03244198204788094070",
      "author_profile_id": "03244198204788094070",
      "content": "I am using embedded mode of mod\\_wsgi for my django application. Also i am using daemons to do some background processing for my application.  \nProblem is my processes are running twice everytime.  \nI have used all the directives.Please point me in the direction to solve this",
      "timestamp": "March 23, 2015 at 3:22 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1427041356875#c5139037046971070548",
      "is_blog_author": false
    },
    {
      "comment_id": "4373635926085574114",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@awais If you need help there is the mod\\_wsgi mailing list. Comments on blog posts are not the appropriate place for debugging problems. I would very much suggest you use that list to resolve your issue.  \n  \nYou can find details at:  \n  \nhttp://code.google.com/p/modwsgi/wiki/WhereToGetHelp?tm=6\\#Asking\\_Your\\_Questions",
      "timestamp": "March 23, 2015 at 9:56 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1427064982491#c4373635926085574114",
      "is_blog_author": true
    },
    {
      "comment_id": "2842286495544269031",
      "author": "K-Z",
      "author_url": "https://www.blogger.com/profile/16991254204755301832",
      "author_profile_id": "16991254204755301832",
      "content": "Awsum post...helped a lot....thank you ....:\\)",
      "timestamp": "July 3, 2015 at 5:22 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1435908176664#c2842286495544269031",
      "is_blog_author": false
    },
    {
      "comment_id": "1074637367529832788",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/10235227671273462948",
      "author_profile_id": "10235227671273462948",
      "content": "@Graham.  \n  \nWhich file should I refer to while I am looking for this message   \n  \n\"If the configuration is such that the WSGI application is running in embedded mode, then you will see:  \n  \nmod\\_wsgi.process\\_group = ''\"  \n  \nI modified my apache2.conf and set the log level to Info but I don't see this line being printed to apache2/error.log or apache2/access.log",
      "timestamp": "January 10, 2017 at 7:40 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1483994412686#c1074637367529832788",
      "is_blog_author": false
    },
    {
      "comment_id": "3208242564486843289",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@kiran If you have managed to set up the WSGI script file so it is used, the message should appear in the browser when you make a request against the application. More details about this check in http://modwsgi.readthedocs.io/en/develop/user-guides/checking-your-installation.html\\#embedded-or-daemon-mode  \n  \nBTW, if you have LogLevel at info, the error log should show messages about when WSGI script files are being loaded. These also show information about whether you are using daemon mode. The script load message would show process='' for embedded mode, bit a non empty string for daemon mode. If you aren't even see a script loading message for the test script, then Apache isn't loaded correctly  \n  \nAlso, those scripts as shown probably will not work on Python 3. They would need to be changed.",
      "timestamp": "January 10, 2017 at 7:47 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1483994839080#c3208242564486843289",
      "is_blog_author": true
    },
    {
      "comment_id": "3883533942445698704",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/16054218946938451360",
      "author_profile_id": "16054218946938451360",
      "content": "Using apache mpm\\_event do you still recommend using mod\\_wsgi in daemon mode?",
      "timestamp": "February 16, 2017 at 7:47 AM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1487191643672#c3883533942445698704",
      "is_blog_author": false
    },
    {
      "comment_id": "371093503096681043",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Aron I will always recommend daemon mode. There are a huge number of more options available to configure mod\\_wsgi daemon processes to ensure a more robust application which can recover from problems. They aren't necessarily on by default though, so you still have to configure them if setting up Apache/mod\\_wsgi yourself. If you use mod\\_wsgi-express it provides much better defaults with all sorts of timeouts enabled so it recovers when things get stuck etc. Trying install mod\\_wsgi-express by running 'pip install mod\\_wsgi' and then run 'mod\\_wsgi-express start-server --help' and you will see all sorts of options which come by virtue of WSGIDaemonProcess directive, and what I think are sane defaults.",
      "timestamp": "February 16, 2017 at 1:45 PM",
      "permalink": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html?showComment=1487213108017#c371093503096681043",
      "is_blog_author": true
    }
  ],
  "labels": [
    "apache",
    "mod_wsgi",
    "python"
  ],
  "metadata": {
    "published_timestamp": "2012-10-13T21:46:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Why are you using embedded mode of mod_wsgi?",
    "og_title": "Why are you using embedded mode of mod_wsgi?",
    "og_description": "If you are using Apache/mod_wsgi  and when you set it up all you cared about was getting something working, but didn't care much for underst...",
    "og_url": "http://blog.dscpl.com.au/2012/10/why-are-you-using-embedded-mode-of.html"
  },
  "downloaded_images": []
}