{
  "title": "Returning a string as the iterable from a WSGI application.",
  "content": "The possible performance consequences of returning many separate data blocks from a WSGI application were covered in the [previous post](http://blog.dscpl.com.au/2015/05/effects-of-yielding-multiple-blocks-in.html). In that post the WSGI application used as an example was one which returned the contents of a file as many small blocks of data. Part of the performance problems seen arose due to how the WSGI servers would flush each individual block of data out, writing it onto the socket connection back to the HTTP client. Flushing the data in this way for many small blocks, as opposed to as few as possible larger blocks had a notable overhead, especially when writing back to an INET socket connection.\n\nIn this post I want to investigate an even more severe case of this problem that can occur. For that we need to go back and start over with the more typical way that most Python web frameworks return response data. That is, as a single large string.\n\n> \n>     def application(environ, start_response):  \n>     >     status = '200 OK'  \n>     >     output = 1024*1024*b'X'\n>     \n>     \n>         response_headers = [('Content-type', 'text/plain'),  \n>     >             ('Content-Length', str(len(output)))]  \n>     >     start_response(status, response_headers)\n>     \n>     \n>         return [output]\n\nIn this example I have increased the length of the string to be returned so it is 1MB in size.\n\nIf we run this under mod\\_wsgi-express and use 'curl' then we get an adequately quick response as we would expect.\n\n> \n>     $ time curl -s -o /dev/null http://localhost:8000/\n>     \n>     \n>     real 0m0.017s  \n>     > user 0m0.006s  \n>     > sys 0m0.005s\n\n# Response as an iterable\n\nAs is known, the response from a WSGI application needs to be an iterable of byte strings. The more typical scenarios are that a WSGI application would return either a list of byte strings, or it would be implemented as a generator function which would yield one or more byte strings.\n\nThat the WSGI server will accept any iterable does mean that people new to writing Python WSGI applications often make a simple mistake. That is that instead of returning a list of byte strings, they simply return the byte string instead.\n\n> \n>     def application(environ, start_response):  \n>     >     status = '200 OK'  \n>     >     output = 1024*1024*b'X'\n>     \n>     \n>         response_headers = [('Content-type', 'text/plain'),  \n>     >             ('Content-Length', str(len(output)))]  \n>     >     start_response(status, response_headers)\n>     \n>     \n>         return output\n\nBecause a byte string is also an iterable then the code will still appear to run fine, returning the response expected back to the HTTP client. For a small byte string the time taken to display the page back in the browser would appear to be normal, but for a larger byte string it would become evident that something is wrong.\n\nRunning this test with mod\\_wsgi-express again, we can see the time taken balloon out from 17 milliseconds to over 3 seconds:\n\n> \n>     $ time curl -s -o /dev/null http://localhost:8000/\n>     \n>     \n>     real 0m3.659s  \n>     > user 0m0.294s  \n>     > sys 0m1.544s\n\nUse gunicorn, and as we saw in the previous post the results are much worse again.\n\n> \n>     $ time curl -s -o /dev/null http://localhost:8000/\n>     \n>     \n>     real 0m23.762s  \n>     > user 0m1.446s  \n>     > sys 0m7.085s\n\nThe reason the results are so bad is that when a string is returned as the iterable, when iterating over it you are dealing with the byte string one byte at a time. This means that when the WSGI server is writing the response back to the HTTP client, it is in turn doing it one byte at a time. The overhead of writing one byte at a time to the socket connection is dwarfing everything else.\n\nAs was covered in the prior post, this is entirely expected behaviour for a WSGI server. The mistake here is entirely in the example code and the code should be corrected.\n\nAcknowledging that this would be a problem with a users code, lets now though see what happens when this example is run through uWSGI.\n\n> \n>     $ time curl -s -o /dev/null http://localhost:8000/\n>     \n>     \n>     real 0m0.019s  \n>     > user 0m0.006s  \n>     > sys 0m0.007s\n\nRather than the larger time we would expect to see, when using uWSGI the time taken is still down at 19 milliseconds.\n\nThis may seem to be a good result, but what is happening here is that uWSGI has decided to break with conforming to the WSGI specification and has added special checking to detect this sort of user mistake. Instead of treating the result as an iterable as it is required to by the WSGI specification, it takes the whole string and uses it as is.\n\nYou may still be thinking this is great, but it isn't really and will only serve to hide the original mistake, resulting in users writing and shipping code with a latent bug. The problem will only become evident when the WSGI application is run on a different WSGI server which does conform to the WSGI specification.\n\nThis could be disastrous if the WSGI application was being shipped out to numerous customers where it was the customer who decided what WSGI server they used.\n\nIn addition to there being a problem when run on a conforming WSGI server, there will also be a problem if someone took the WSGI application and wrapped it with a WSGI middleware.\n\nThis can be illustrated by now going back and adding the WSGI application timing decorator.\n\n> \n>     from timer1 import timed_wsgi_application1\n>     \n>     \n>     @timed_wsgi_application1  \n>     > def application(environ, start_response):\n>     \n>     \n>         status = '200 OK'  \n>     >     output = 1024*1024*b'X'\n>     \n>     \n>         response_headers = [('Content-type', 'text/plain'),  \n>     >             ('Content-Length', str(len(output)))]  \n>     >     start_response(status, response_headers)\n>     \n>     \n>         return output\n\nWith the decorator, running with uWSGI again we now get:\n\n> \n>     $ time curl -s -o /dev/null http://localhost:8000/\n>     \n>     \n>     real 0m13.876s  \n>     > user 0m0.925s  \n>     > sys 0m3.407s\n\nSo only now do we get the sort of result we were expecting, with it taking 13 seconds.\n\nThe reason that the problem only now shows up with uWSGI is because the wrapper which gets added by the WSGI middleware, around the iterable passed back from the WSGI application, causes the uWSGI check for an explicit string value to fail.\n\nThis demonstrates how fragile the WSGI application now is. If it is intended to be something that is used by others, you cannot control whether those users may use any WSGI middleware around it. A user might therefore very easily and unknowingly, cause problems for themselves and have no idea why or even that there is a problem.\n\n# Application portability\n\nAs much as the WSGI specification is derided by many, it can't be denied it eliminated the problem that existed at the time with there being many different incompatible ways to host Python web applications. Adherence to the WSGI specification by both WSGI applications and servers is key to that success. It is therefore very disappointing to see where WSGI servers deviate from the WSGI specification as it is a step away from the goal of application portability.\n\nWhat you instead end up with is pseudo WSGI applications which are in fact locked in to a specific WSGI server implementation and will not run correctly or perform well on other WSGI servers.\n\nIf you are developing Python web applications at the WSGI level rather than using a web framework and you value WSGI application portability, one thing you can do to try and ensure WSGI compliance is to use the WSGI validator found in the 'wsgiref.validate' module of the Python standard library.\n\n> \n>     def application(environ, start_response):  \n>     >     status = '200 OK'  \n>     >     output = 1024*1024*b'X'\n>     \n>     \n>         response_headers = [('Content-type', 'text/plain'),  \n>     >             ('Content-Length', str(len(output)))]  \n>     >     start_response(status, response_headers)\n>     \n>     \n>         return output  \n>     >   \n>     > import wsgiref.validate  \n>     >   \n>     > application = wsgiref.validate.validator(application)\n\nThis will perform a range of checks to ensure some basic measure of WSGI compliance and also good practice.\n\nIn this particular example of where a string was returned as the WSGI application iterable, the WSGI validator will flag it as a problem, with the error:\n\n> \n>     AssertionError: You should not return a string as your application iterator, instead return a single-item list containing that string.\n\nSo run the validator on your application during development or testing at times and exercise your WSGI application to get good coverage. This will at least help with some of the main issues that may come up, although by no means all given how many odd corner cases that exist within the WSGI specification.",
  "date": "Tuesday, May 19, 2015",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2015/05/returning-string-as-iterable-from-wsgi.html",
  "post_id": "344938495038536076",
  "blog_id": "2363643920942057324",
  "comments": [],
  "labels": [
    "gunicorn",
    "mod_wsgi",
    "python",
    "uWSGI",
    "wsgi"
  ],
  "metadata": {
    "published_timestamp": "2015-05-19T21:03:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Returning a string as the iterable from a WSGI application.",
    "og_title": "Returning a string as the iterable from a WSGI application.",
    "og_description": "The possible performance consequences of returning many separate data blocks from a WSGI application were covered in the previous post . In ...",
    "og_url": "http://blog.dscpl.com.au/2015/05/returning-string-as-iterable-from-wsgi.html"
  },
  "downloaded_images": []
}