{
  "title": "The interaction between decorators and descriptors.",
  "content": "This is the second post in my series of blog posts about Python decorators and how I believe they are generally poorly implemented. It follows on from the first post titled '[How you implemented your Python decorator is wrong](/posts/2014/01/how-you-implemented-your-python/)'.  \n  \nIn that first post I described a number of ways in which the traditional way that Python decorators are implemented is lacking. These were:  \n  \n\n\n  * Preservation of function \\_\\_name\\_\\_ and \\_\\_doc\\_\\_.\n  * Preservation of function argument specification.\n  * Preservation of ability to get function source code.\n  * Ability to apply decorators on top of other decorators that are implemented as descriptors.\n\n  \nI described previously how functools.wraps\\(\\) attempts to solve the problem with preservation of the introspection of the \\_\\_name\\_\\_ and \\_\\_doc\\_\\_ attributes, but highlight one case in Python 2 where it can fail, and also note that it doesn't help with the preservation of the function argument specification nor the ability to access the source code.  \n  \nIn this post I want to focus mainly on the last of the issues above. That is the interaction between decorators and descriptors, where a function wrapper is applied to a Python object which is actually a descriptor.  \n  \n\n\n###  What are descriptors?\n\n  \nI am not going to give an exhaustive analysis of what descriptors are or how they work so if you want to understand them in depth, I would suggest reading up about them elsewhere.  \n  \nIn short though, a descriptor is an object attribute with “binding behaviour”, one whose attribute access has been overridden by methods in the descriptor protocol. Those methods are \\_\\_get\\_\\_\\(\\), \\_\\_set\\_\\_\\(\\), and \\_\\_delete\\_\\_\\(\\). If any of those methods are defined for an object, it is said to be a descriptor.  \n  \n\n\n  * obj.attribute   \n\\--> attribute.\\_\\_get\\_\\_\\(obj, type\\(obj\\)\\) \n  * obj.attribute = value  \n\\--> attribute.\\_\\_set\\_\\_\\(obj, value\\) \n  * del obj.attribute   \n\\--> attribute.\\_\\_delete\\_\\_\\(obj\\)\n\n  \nWhat this means is that if an attribute of a class has any of these special methods defined, when the corresponding operation is performed on that attribute of a class, then those methods will be called instead of the default action. This allows an attribute to override how those operations are going to work.  \n  \nYou may well be thinking that you have never made use of descriptors, but fact is that function objects are actually descriptors. When a function is originally added to a class definition it is as a normal function. When you access that function using a dotted attribute path, you are invoking the \\_\\_get\\_\\_\\(\\) method to bind the function to the class instance, turning it into a bound method of that object.  \n\n\n> def f\\(obj\\): pass  \n>  >>> hasattr\\(f, '\\_\\_get\\_\\_'\\)  \n>  True \n\n> >>> f  \n>  <function f at 0x10e963cf8>\n\n> >>> obj = object\\(\\)  \n>  >>> f.\\_\\_get\\_\\_\\(obj, type\\(obj\\)\\)  \n>  <bound method object.f of <object object at 0x10e8ac0b0>>\n\nSo when calling a method of a class, it is not the \\_\\_call\\_\\_\\(\\) method of the original function object that is called, but the \\_\\_call\\_\\_\\(\\) method of the temporary bound object that is created as a result of accessing the function.  \n  \nYou of course don't usually see all these intermediary steps and just see the outcome.  \n\n\n> >>> class Object\\(object\\):  \n>  ... def f\\(self\\): pass \n\n> >>> obj = Object\\(\\)  \n>  >>> obj.f  \n>  <bound method Object.f of <\\_\\_main\\_\\_.Object object at 0x10abf29d0>>\n\nLooking back now at the example given in the first blog post where we wrapped a decorator around a class method, we encountered the error:  \n\n\n> class Class\\(object\\):  \n>  @function\\_wrapper  \n>  @classmethod  \n>  def cmethod\\(cls\\):  \n>  pass \n\n> Class.cmethod\\(\\) \n\n> Traceback \\(most recent call last\\):  \n>  File \"classmethod.py\", line 15, in <module>  \n>  Class.cmethod\\(\\)  \n>  File \"classmethod.py\", line 6, in \\_wrapper  \n>  return wrapped\\(\\*args, \\*\\*kwargs\\)  \n>  TypeError: 'classmethod' object is not callable\n\nThe problem with this example was that for the @classmethod decorator to work correctly, it is dependent on the descriptor protocol being applied properly. This is because the \\_\\_call\\_\\_\\(\\) method only exists on the result returned by \\_\\_get\\_\\_\\(\\) when it is called, there is no \\_\\_call\\_\\_\\(\\) method on the @classmethod decorator itself.  \n  \nMore specifically, the simple type of decorator that people normally use is not itself honouring the descriptor protocol and applying that to the wrapped object to yield the bound function object which should actually be called. Instead it is simply calling the wrapped object directly, which will fail if it doesn't have a \\_\\_call\\_\\_\\(\\).  \n  \nWhy then does applying a decorator to a normal instance method still work?  \n  \nThis still works because a normal function still has a \\_\\_call\\_\\_\\(\\) method. In bypassing the descriptor protocol of the wrapped function it is calling this. Although the binding protocol is side stepped, things still work out because the wrapper will pass the 'self' argument for the instance explicitly as the first argument when calling the original unbound function object.  \n  \nFor a normal instance method the result in this situation is effectively the same. It only falls apart when the wrapped object, as in the case of @classmethod, are dependent on the descriptor protocol being applied correctly.  \n  \n\n\n###  Wrappers as descriptors\n\n  \nThe way to solve this problem where the wrapper is not honouring the descriptor protocol and performing binding on the wrapped object in the case of a method on a class, is for wrappers to also be descriptors.  \n\n\n> class bound\\_function\\_wrapper\\(object\\): \n\n> def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  self.wrapped = wrapped \n\n> def \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \n>  return self.wrapped\\(\\*args, \\*\\*kwargs\\) \n\n> class function\\_wrapper\\(object\\): \n\n> def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  self.wrapped = wrapped \n\n> def \\_\\_get\\_\\_\\(self, instance, owner\\):  \n>  wrapped = self.wrapped.\\_\\_get\\_\\_\\( instance, owner\\)  \n>  return bound\\_function\\_wrapper\\(wrapped\\) \n\n> def \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \n>  return self.wrapped\\(\\*args, \\*\\*kwargs\\)\n\nIf the wrapper is applied to a normal function, the \\_\\_call\\_\\_\\(\\) method of the wrapper is used. If the wrapper is applied to a method of a class, the \\_\\_get\\_\\_\\(\\) method is called, which returns a new bound wrapper and the \\_\\_call\\_\\_\\(\\) method of that is invoked instead. This allows our wrapper to be used around descriptors as it propagates the descriptor protocol.  \n  \nSo since using a function closure will ultimately fail if used around a decorator which is implemented as a descriptor, the situation we therefore have is that if we want everything to work, then decorators should always use a class based wrapper, where the class implements the descriptor protocol as shown.  \n  \nThe question now is how do we address the other issues that were listed.  \n  \nWe solved naming using functools.wrap\\(\\)/functools.update\\_wrapper\\(\\) before, but what do they do and can we still use them.  \n  \nWell wraps\\(\\) just uses update\\_wrapper\\(\\), so we just need to look at it.  \n\n\n> WRAPPER\\_ASSIGNMENTS = \\('\\_\\_module\\_\\_',  \n>  '\\_\\_name\\_\\_', '\\_\\_qualname\\_\\_', '\\_\\_doc\\_\\_',  \n>  '\\_\\_annotations\\_\\_'\\)\n\n> WRAPPER\\_UPDATES = \\('\\_\\_dict\\_\\_',\\) \n\n> def update\\_wrapper\\(wrapper, wrapped,  \n>  assigned = WRAPPER\\_ASSIGNMENTS,  \n>  updated = WRAPPER\\_UPDATES\\): \n\n> wrapper.\\_\\_wrapped\\_\\_ = wrapped \n\n> for attr in assigned:  \n>  try:  \n>  value = getattr\\(wrapped, attr\\)  \n>  except AttributeError:  \n>  pass  \n>  else:  \n>  setattr\\(wrapper, attr, value\\) \n\n> for attr in updated:  \n>  getattr\\(wrapper, attr\\).update\\(  \n>  getattr\\(wrapped, attr, \\{\\}\\)\\)\n\nWhat is shown here is what is in Python 3.3, although that actually has a bug in it, which is fixed in Python 3.4. :-\\)  \n  \nLooking at the body of the function, three things are being done. First off a reference to the wrapped function is saved as \\_\\_wrapped\\_\\_. This is the bug, as it should be done last.  \n  \nThe second is to copy those attributes such as \\_\\_name\\_\\_ and \\_\\_doc\\_\\_.  \n  \nFinally the third thing is to copy the contents of \\_\\_dict\\_\\_ from the wrapped function into the wrapper, which could actually result in quite a lot of objects needing to be copied.  \n  \nIf we are using a function closure or straight class wrapper this copying is able to be done at the point that the decorator is applied.  \n  \nWith the wrapper being a descriptor though, it technically now also needs to be done in the bound wrapper.  \n\n\n> class bound\\_function\\_wrapper\\(object\\):  \n>  def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  self.wrapped = wrapped  \n>  functools.update\\_wrapper\\(self, wrapped\\) \n\n> class function\\_wrapper\\(object\\):  \n>  def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  self.wrapped = wrapped  \n>  functools.update\\_wrapper\\(self, wrapped\\)\n\nAs the bound wrapper is created every time the wrapper is called for a function bound to a class, this is going to be too slow. We need a more performant way of handling this.  \n  \n\n\n###  Transparent object proxy\n\n  \nThe solution to the performance issue is to use what is called an object proxy. This is a special wrapper class which looks and behaves like what it wraps.  \n\n\n> class object\\_proxy\\(object\\): \n\n> def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  self.wrapped = wrapped  \n>  try:  \n>  self.\\_\\_name\\_\\_= wrapped.\\_\\_name\\_\\_  \n>  except AttributeError:  \n>  pass \n\n> @property  \n>  def \\_\\_class\\_\\_\\(self\\):  \n>  return self.wrapped.\\_\\_class\\_\\_ \n\n> def \\_\\_getattr\\_\\_\\(self, name\\):  \n>  return getattr\\(self.wrapped, name\\)\n\nA fully transparent object proxy is a complicated beast in its own right, so I am going to gloss over the details for the moment and cover it in a separate blog post at some point.  \n  \nThe above example though is a minimal representation of what it does. In practice it actually needs to do a lot more than this though if it is to serve as a general purpose object proxy usable in the more generic use case of monkey patching.  \n  \nIn short though, it copies limited attributes from the wrapped object to itself, and otherwise uses special methods, properties and \\_\\_getattr\\_\\_\\(\\) to fetch attributes from the wrapped object only when required thereby avoiding the need to copy across lots of attributes which may never actually be accessed.  \n  \nWhat we now do is derive our wrapper class from the object proxy and do away with calling update\\_wrapper\\(\\).  \n\n\n> class bound\\_function\\_wrapper\\(object\\_proxy\\):  \n>  def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  super\\(bound\\_function\\_wrapper, self\\).\\_\\_init\\_\\_\\(wrapped\\)\n\n> def \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \n>  return self.wrapped\\(\\*args, \\*\\*kwargs\\) \n\n> class function\\_wrapper\\(object\\_proxy\\):  \n>  def \\_\\_init\\_\\_\\(self, wrapped\\):  \n>  super\\(function\\_wrapper, self\\).\\_\\_init\\_\\_\\(wrapped\\)\n\n> def \\_\\_get\\_\\_\\(self, instance, owner\\):  \n>  wrapped = self.wrapped.\\_\\_get\\_\\_\\( instance, owner\\)  \n>  return bound\\_function\\_wrapper\\(wrapped\\) \n\n> def \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \n>  return self.wrapped\\(\\*args, \\*\\*kwargs\\) \n\nIn doing this, attributes like \\_\\_name\\_\\_ and \\_\\_doc\\_\\_, when queried from the wrapper, return the values from the wrapped function. We don't therefore as a result have the problem we did before where details were being returned from the wrapper instead.  \n  \nUsing a transparent object proxy in this way also means that calls like inspect.getargspec\\(\\) and inspect.getsource\\(\\) will now work and return what we expect. So we have actually managed to solve those two problems at the same time without any extra effort, which is a bonus.  \n  \n\n\n###  Making this all more usable\n\n  \nAlthough this pattern addresses the problems which were originally identified, it consists of a lot of boiler plate code. Further, you now have two places in the code where the wrapped function is actually being called where you would need to insert the code to implement what the decorator was intended to do.  \n  \nReplicating this every time you need to implement a decorator would therefore be a bit of a pain.  \n  \nWhat we can instead do is wrap this all up and package it up into a decorator factory, thereby avoiding the need for this all to be done manually each time. How to do that will be the subject of the next blog post in this series.  \n  \nFrom that point we can start to look at how we can further improve the functionality and introduce new capabilities which are generally hard to pull off with the way that decorators are normally implemented.  \n  \nAnd before people start to complain that using this pattern is going to be too slow in the general use case, I will also address that in a future post as well, so just hold your complaints for now.",
  "date": "Tuesday, January 7, 2014",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html",
  "post_id": "7579850449762006304",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "1638132922107317646",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/00436489017052168136",
      "author_profile_id": "00436489017052168136",
      "content": "On mixing descriptors and decorators, I've often advised people that the descriptor part should wrap the decorator part. For example:  \n  \n@staticmethod  \n@decorator  \ndef func\\(\\):  \n...  \n  \nBut not this:  \n  \n@decorator  \n@staticmethod  \ndef func\\(\\):  \n...  \n  \nCurious if you had any thoughts about this?",
      "timestamp": "January 7, 2014 at 11:09 PM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1389096579920#c1638132922107317646",
      "is_blog_author": false
    },
    {
      "comment_id": "5793784098519567458",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "If that inner decorator is itself implemented as a descriptor, placing it inside of @classmethod will not strictly work properly. This is an issue with @classmethod and was one of the things I expected to cover in the next post.",
      "timestamp": "January 8, 2014 at 8:47 AM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1389131230574#c5793784098519567458",
      "is_blog_author": true
    },
    {
      "comment_id": "8820868809856152799",
      "author": "eternicode",
      "author_url": "https://www.blogger.com/profile/06575536753116773887",
      "author_profile_id": "06575536753116773887",
      "content": "class bound\\_function\\_wrapper\\(object\\_proxy\\):  \ndef \\_\\_init\\_\\_\\(self, wrapped\\):  \nsuper\\(bound\\_function\\_wrapper, self\\).\\_\\_init\\_\\_\\(wrapped\\)  \n  \nI may be unaware of some nuance here, but isn't an \\_\\_init\\_\\_ that just calls super.\\_\\_init\\_\\_ the same as having no \\_\\_init\\_\\_ defined at all in the subclass?",
      "timestamp": "January 9, 2014 at 10:23 AM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1389223413687#c8820868809856152799",
      "is_blog_author": false
    },
    {
      "comment_id": "6752933875755900062",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "True. I wanted to make is explicit as later on that constructor has extra arguments added which will be stored on the wrapper itself and used by other methods.",
      "timestamp": "January 9, 2014 at 10:26 AM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1389223587067#c6752933875755900062",
      "is_blog_author": true
    },
    {
      "comment_id": "6118934143800352936",
      "author": "Daniel Sank",
      "author_url": "https://www.blogger.com/profile/15330591180633811520",
      "author_profile_id": "15330591180633811520",
      "content": "In the blog you propose two separate classes. You have function\\_wrapper to be used as a decorator for both normal functions and methods, and you have bound\\_function\\_wrapper, which is invoked to handle cases where function\\_wrapper is accessed as a descriptor. Does bound\\_function\\_wrapper need to exist? It seems that every place it might be invoked could be replaced by function\\_wrapper, since function\\_wrapper implements all of the methods that bound\\_function\\_wrapper implements, and with exactly the same code.  \n  \nclass bound\\_function\\_wrapper\\(object\\_proxy\\):  \ndef \\_\\_init\\_\\_\\(self, wrapped\\):  \nsuper\\(bound\\_function\\_wrapper, self\\).\\_\\_init\\_\\_\\(wrapped\\)  \n  \ndef \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \nreturn self.wrapped\\(\\*args, \\*\\*kwargs\\)   \n  \nclass function\\_wrapper\\(object\\_proxy\\):  \ndef \\_\\_init\\_\\_\\(self, wrapped\\):  \nsuper\\(function\\_wrapper, self\\).\\_\\_init\\_\\_\\(wrapped\\)  \n  \ndef \\_\\_get\\_\\_\\(self, instance, owner\\):  \nwrapped = self.wrapped.\\_\\_get\\_\\_\\( instance, owner\\)  \nreturn bound\\_function\\_wrapper\\(wrapped\\)   \n  \ndef \\_\\_call\\_\\_\\(self, \\*args, \\*\\*kwargs\\):  \nreturn self.wrapped\\(\\*args, \\*\\*kwargs\\)",
      "timestamp": "May 25, 2014 at 2:41 AM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1400949688345#c6118934143800352936",
      "is_blog_author": false
    },
    {
      "comment_id": "3271369337965186429",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Daniel You misunderstand. The function\\_wrapper class is still used to handle the case where the function is first bound by the descriptor protocol. The bound\\_function\\_wrapper is the result of the binding process and not the starting point. It is similar to how instance methods in Python 2 exist in unbound and bound forms. It also isn't true that the methods of each are the same. The \\_\\_call\\_\\_\\(\\) method implementations need to be different. The bound wrapped also needs an instance variable. Trying to do it all in one class just be comes a bit messy and easier to separate out the concepts and not try and force it into one class. Some of the differences will become clearer in later blog posts in this series. I also advise to actually look at the source code of the wrapt package. This isn't a proposal. There is a working and available implementation for all of this.",
      "timestamp": "May 25, 2014 at 1:02 PM",
      "permalink": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html?showComment=1400986956089#c3271369337965186429",
      "is_blog_author": true
    }
  ],
  "labels": [
    "decorators",
    "python"
  ],
  "metadata": {
    "published_timestamp": "2014-01-07T22:00:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: The interaction between decorators and descriptors.",
    "og_title": "The interaction between decorators and descriptors.",
    "og_description": "This is the second post in my series of blog posts about Python decorators and how I believe they are generally poorly implemented. It follo...",
    "og_url": "http://blog.dscpl.com.au/2014/01/the-interaction-between-decorators-and.html"
  },
  "downloaded_images": []
}