{
  "title": "Transparent object proxies in Python.",
  "content": "This is a quick rejoinder to a specific comment made in Armin Ronacher's recent blog post titled '[The Python I Would Like To See](http://lucumr.pocoo.org/2014/8/16/the-python-i-would-like-to-see/)'.\n\nIn that post Armin gives the following example of something that is possible with old style Python classes.\n    \n    \n    >>> original = 42  \n    >>> class FooProxy:  \n    ... def __getattr__(self, x):  \n    ... return getattr(original, x)  \n    ...  \n    >>> proxy = FooProxy()  \n    >>> proxy  \n    42  \n    >>> 1 + proxy  \n    43  \n    >>> proxy + 1  \n    43\n\nArmin then goes on to say:\n\n```python\n\"\"\"We have less features today than we had in Python 2 for a more complex type system. Because the code above cannot be done with new style classes and more.\"\"\"\n```\n\nActually that isn't strictly true. It is possible to write a transparent object proxy using new style classes, but in doing so the proxy itself must adopt the conventions around the use of the special slot methods.\n    \n    \n    >>> import wrapt  \n    >>> original = 42  \n    >>> proxy = wrapt.ObjectProxy(original)  \n    >>> print(proxy)  \n    42  \n    >>> print(1 + proxy)  \n    43  \n    >>> print(proxy + 1)  \n    43\n\nImplementing a general purpose transparent object proxy is non trivial and there are lots of horrible corner cases you have to deal with. The Python standard library does actually have an example of such a proxy, albeit specifically for use in conjunction with weakref instances. Unfortunately the Python standard library itself doesn't get all the corner cases correct, which for one case you can read about in [\\#19070](http://bugs.python.org/issue19070). It is also implemented in C, so isn't particularly useful as an example for illustrating what is required.\n\nBecause it is a complicated topic I am not going to go into the specifics of how to implement a transparent object proxy. It was previously my intent to post on just this topic in some followup posts to my prior series on decorators, as the decorator implementation I gave was actually implemented on top of a transparent object proxy, but I don't see myself doing that for the time being.\n\nAs a result, all I can suggest if you are interested, is that you have a dig through the code implementing my [wrapt](https://github.com/GrahamDumpleton/wrapt) package. It contains transparent object proxy implementations in both C code and as pure Python. It builds on that to implement a function wrapper with binding behaviour as well as all sorts of functions to support monkey patching and the implementation of decorators. There is also an implementation of a post import hook mechanism by which to trigger monkey patching at the time of modules being imported.\n\nSo if you are into mind bending stuff, have a look at wrapt.",
  "date": "2014-08-17",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2014/08/transparent-object-proxies-in-python.html",
  "post_id": "3651363996579395824",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "4942639164682163045",
      "author": "Armin Ronacher",
      "author_url": "https://www.blogger.com/profile/12523637137374776150",
      "author_profile_id": "12523637137374776150",
      "content": "I'm unfortunately well aware: https://github.com/mitsuhiko/werkzeug/blob/master/werkzeug/local.py\\#L250",
      "timestamp": "August 17, 2014 at 8:19 PM",
      "permalink": "http://blog.dscpl.com.au/2014/08/transparent-object-proxies-in-python.html?showComment=1408270764956#c4942639164682163045",
      "is_blog_author": false
    }
  ],
  "labels": [],
  "metadata": {
    "published_timestamp": "2014-08-17T14:57:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Transparent object proxies in Python.",
    "og_title": "Transparent object proxies in Python.",
    "og_description": "This is a quick rejoinder to a specific comment made in Armin Ronacher's recent blog post titled ' The Python I Would Like To See '.  In tha...",
    "og_url": "http://blog.dscpl.com.au/2014/08/transparent-object-proxies-in-python.html"
  },
  "downloaded_images": []
}