{
  "title": "Implementing WSGI application objects.",
  "content": "Per the WSGI specification, an application object used as the entry point for requests is described as follows:  \n  \n\"\"\"The application object is simply a callable object that accepts two arguments. The term \"object\" should not be misconstrued as requiring an actual object instance: a function, method, class, or instance with a \\_\\_call\\_\\_ method are all acceptable for use as an application object.\"\"\"  \n  \nBecause I am doing something where I need to work with all the possible types of application objects and so needed some examples for testing, but also because sometimes newbies get a bit confused about what this means in practice, I thought it worthwhile documenting some examples of the different types of WSGI application objects.  \n  \nFirst though just to expand a bit on what the inputs and outputs to the application object are for each request, I’ll quote a few other sections of the WSGI specification. I am using PEP 3333 for the quotations in case you find it differs slightly from PEP 333 that preceded it. Some parts of the paragraphs quoted have been omitted.  \n  \n\"\"\"The application object must accept two positional arguments. For the sake of illustration, we have named them environ and start\\_response, but they are not required to have these names. A server or gateway must invoke the application object using positional \\(not keyword\\) arguments. \\(E.g. by calling result = application\\(environ, start\\_response\\) as shown above.\\)  \n  \nThe environ parameter is a dictionary object, containing CGI-style environment variables. This object must be a builtin Python dictionary \\(not a subclass, UserDict or other dictionary emulation\\).  \n  \nThe start\\_response parameter is a callable accepting two required positional arguments, and one optional argument. For the sake of illustration, we have named these arguments status, response\\_headers, and exc\\_info, but they are not required to have these names, and the application must invoke the start\\_response callable using positional arguments \\(e.g. start\\_response\\(status, response\\_headers\\)\\).  \n  \nWhen called by the server, the application object must return an iterable yielding zero or more bytestrings. This can be accomplished in a variety of ways, such as by returning a list of bytestrings, or by the application being a generator function that yields bytestrings, or by the application being a class whose instances are iterable. Regardless of how it is accomplished, the application object must always return an iterable yielding zero or more bytestrings.\"\"\"  \n  \nSo, that sets the scene of what to expect, now for the examples.  \n  \nThe simplest example is where the application object is a function. For this case we would have:\n    \n    \n    def application(environ, start_response):  \n        status = '200 OK'   \n        response_headers = [('Content-type', 'text/plain')]  \n        start_response(status, response_headers)   \n              \n        return [\"1\\n\", \"2\\n\", \"3\\n\", \"4\\n\", \"5\\n\"]\n\nThe result returned must be an iterable yielding zero or more byte strings. Here we have used a list but as the specification outlines the application object itself can be a generator.\n    \n    \n    def application(environ, start_response):  \n        status = '200 OK'   \n        response_headers = [('Content-type', 'text/plain')]  \n        start_response(status, response_headers)   \n              \n        yield \"1\\n\"  \n        yield \"2\\n\"  \n        yield \"3\\n\"  \n        yield \"4\\n\"  \n        yield \"5\\n\"\n\nA class instance could also be returned so long as it supports the iterator protocol.\n    \n    \n    class Iterable:  \n        def __iter__(self):  \n            yield \"1\\n\"  \n            yield \"2\\n\"  \n            yield \"3\\n\"  \n            yield \"4\\n\"  \n            yield \"5\\n\"  \n      \n    def application(environ, start_response):  \n        status = '200 OK'  \n        response_headers = [('Content-type', 'text/plain')]  \n        start_response(status, response_headers)  \n          \n        return Iterable()\n\nor:\n    \n    \n    class Iterable:  \n        def __init__(self):  \n            self.__count = 0  \n      \n        def __iter__(self):  \n            return self  \n      \n        def next(self):  \n            if self.__count <= 4:  \n                self.__count += 1  \n                return '%s\\n' % self.__count  \n            raise StopIteration  \n      \n    def application(environ, start_response):  \n        status = '200 OK'  \n        response_headers = [('Content-type', 'text/plain')]  \n        start_response(status, response_headers)  \n      \n        return Iterable()\n\nor finally:\n    \n    \n    class Iterable:  \n        def __getitem__(self, index):  \n            if index <= 4:  \n                return '%s\\n' % (index+1)  \n            raise IndexError  \n      \n    def application(environ, start_response):  \n        status = '200 OK'  \n        response_headers = [('Content-type', 'text/plain')]  \n        start_response(status, response_headers)  \n      \n        return Iterable()\n\nImportant to note is that although a byte string itself is an iterable value, you should never return that explicitly as the result from the WSGI application. It will work if you do that, but the consequence of doing that will be that the underlying WSGI gateway or adapter will still iterate over it. This will result in a single byte being yielded each time, with that single byte being written and then flushed back to the HTTP client. The result of this will obviously be absolutely dreadful performance. So, if you are having performance issues, make sure you are not inadvertently returning a byte string rather than returning a list containing a single byte string value.  \n  \nThe next thing that the application object can be is an instance of a class. In this case as the class instance itself is being executed, it must provide a ‘\\_\\_call\\_\\_\\(\\)’ method with an appropriate signature.\n    \n    \n    class Application:  \n        def __call__(self, environ, start_response):  \n            status = '200 OK'  \n            response_headers = [('Content-type', 'text/plain')]  \n            start_response(status, response_headers)  \n      \n            return [\"1\\n\", \"2\\n\", \"3\\n\", \"4\\n\", \"5\\n\"]  \n          \n    application = Application()\n\nWe have again returned a list here, but as before when using a normal function, the ‘\\_\\_call\\_\\_\\(\\)’ method could be a generator function, or return any sort of iterable object.  \n  \nWhen using a class instance as the application object, if for some reason it doesn’t provide a ‘\\_\\_call\\_\\_\\(\\)’ method and instead has named the entry point another name then one could instead also write:\n    \n    \n    class Application:  \n        def execute(self, environ, start_response):  \n            status = '200 OK'   \n            response_headers = [('Content-type', 'text/plain')]  \n            start_response(status, response_headers)  \n      \n            return [\"1\\n\", \"2\\n\", \"3\\n\", \"4\\n\", \"5\\n\"]  \n              \n    _application = Application()  \n      \n    application = _application.execute\n\nIn other words, a reference to an arbitrary bound method of an instance of a class can be used as the application object. This works the same as if the method were called ‘\\_\\_call\\_\\_\\(\\)’, or if a ‘\\_\\_call\\_\\_\\(\\)’ method were provided which in turned called this second method and returned its result.  \n  \nTechnically you could also use static methods or class methods in the same way, but that would be getting a bit too weird.  \n  \nWhen a normal function was used originally, if it was necessary to cache information between requests then the only way it could be done would be to store any such data as global variables within the module containing the function, or some other module. This effectively precludes the ability to have multiple distinct instances of an application based on that one function.  \n  \nThe way to get around that is to use a class instance as the application object. By doing this you could create multiple instances of the class object with each storing any data requiring to be cached as attributes of that instance of the class instead of as global variables.  \n  \nEither way, because a hosting environment may support multithreading, that is, the ability to handle multiple requests in parallel, any data access, whether it be to global variables or attributes of an instance of the class for the application, should be protected against concurrent access using appropriate thread locking mechanisms.  \n  \nIf for some reason you didn’t need to share data across requests, but did need to share data across multiple functions implementing a WSGI application, then one can use the ‘environ’ dictionary to pass data around. Often this is frowned upon and can get messy for complex data. An alternative to using the ‘environ’ dictionary is to still use a class instance but create an instance of the class per request. To do this, one can use:\n    \n    \n    class Application:  \n        def __init__(self, environ, start_response):  \n            self.__environ = environ  \n            self.__start_response = start_response  \n              \n        def __iter__(self):  \n            status = '200 OK'   \n            response_headers = [('Content-type', 'text/plain')]  \n            self.__start_response(status, response_headers)  \n      \n            yield \"1\\n\"  \n            yield \"2\\n\"  \n            yield \"3\\n\"  \n            yield \"4\\n\"  \n            yield \"5\\n\"  \n      \n    application = Application\n\nFor this scenario, the application object is actually the class object itself rather than an instance of the class. The result of this is that for each request a new instance of the class is created, with the ‘environ’ and ‘start\\_response’ parameters being passed to the constructor of the class.  \n  \nThe result of calling the class object like this to create an instance of the class is the actual instance of the class. The instance returned therefore needs to satisfy the same properties as the result for an application object were it a normal function. That is, the class instance needs to be an iterable object.  \n  \nHere the instance is made iterable by implementing the ‘\\_\\_iter\\_\\_\\(\\)’ method as a generator function. It could though use other methods for making an iterable as shown before, such as:\n    \n    \n    class Application:  \n        def __init__(self, environ, start_response):  \n            self.__environ = environ  \n            self.__start_response = start_response  \n            self.__count = 0  \n          \n        def __iter__(self):  \n            status = '200 OK'   \n            response_headers = [('Content-type', 'text/plain')]  \n            self.__start_response(status, response_headers)  \n            return self  \n                  \n        def next(self):  \n            if self.__count <= 4:  \n                self.__count += 1  \n                return \"%d\\n\" % self.__count  \n              \n            raise StopIteration  \n      \n    application = Application\n\nor:\n    \n    \n    class Application:  \n        def __init__(self, environ, start_response):  \n            self.__environ = environ  \n            self.__start_response = start_response  \n              \n        def __getitem__(self, index):  \n            if index == 0:  \n                status = '200 OK'  \n                response_headers = [('Content-type', 'text/plain')]  \n                self.__start_response(status, response_headers)  \n              \n                return \"%d\\n\" % (index+1)  \n          \n            elif index <= 4:  \n                return \"%d\\n\" % (index+1)  \n                  \n            raise IndexError  \n              \n    application = Application\n\nWhat does all this mean? Not much except that there are lots of ways of implementing the skeleton for a WSGI application object.  \n  \nIn general it doesn’t matter, even if the WSGI application object is used as part of a middleware stack because all the different ways of implementing the application object satisfy the basic requirement as far as processing of input parameters and the subsequent result being an iterable.  \n  \nThe only time where the range of ways for implementing an application object may be an issue is where you are needing to implement decorators for WSGI applications to transparently perform pre and post actions. This is what I am having to deal with and the reason it gets tricky is because you need to deal with both function and class decorators, with function decorators possibly also needing to be aware of the differences between normal functions and class methods.  \n  \nIf you don’t have the luxury of modifying the original source code to apply a decorator and are instead forced to do monkey patching of a system, then you also need to deal with the differences between unbound and bound methods of classes. All lots of fun.  \n  \nAnyway, hope this exploration of the different ways of implementing application objects is useful to someone and when I sort out what I am doing with decorators for WSGI application objects, I’ll look at doing a followup with an explanation of what I worked out about that.  \n  \nBTW, if you know of other ways that WSGI application objects could be implemented, then please followup and describe them. I think I got all of them but could have missed both the obvious and the obscure.",
  "date": "2011-01-05",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html",
  "post_id": "6898389764552731751",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "1231968350200702019",
      "author": "fumanchu",
      "author_url": "https://www.blogger.com/profile/12100140919727858844",
      "author_profile_id": "12100140919727858844",
      "content": "\"there are lots of ways of implementing the skeleton for a WSGI application object...In general it doesn’t matter, even if the WSGI application object is used as part of a middleware stack\"  \n  \nIn practice, it _does_ matter which approach you take when writing middleware, because middleware should ALWAYS expose a close\\(\\) method, even if all it does is call close\\(\\) on the application interface it itself wraps. If it does not, then the server cannot reliably close all the components in a WSGI graph.",
      "timestamp": "January 9, 2011 at 2:15 AM",
      "permalink": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html?showComment=1294499724750#c1231968350200702019",
      "is_blog_author": false
    },
    {
      "comment_id": "1357878573172673146",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "Robert, yes for middleware it can matter. At this point was trying to address the original WSGI application which is the origin of the data and not so much a middleware. Middleware, the obligations of them and the typical patterns for implementation was going to be subject of future post.",
      "timestamp": "January 9, 2011 at 7:58 AM",
      "permalink": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html?showComment=1294520288076#c1357878573172673146",
      "is_blog_author": true
    },
    {
      "comment_id": "4765405698723870064",
      "author": "Kamal Mustafa",
      "author_url": "https://www.blogger.com/profile/02858510377046461486",
      "author_profile_id": "02858510377046461486",
      "content": "I was toying around with simple wsgi application \\(I just learnt about mod\\_wsgi AddHandler directive, for so long I have been using WSGIScriptAlias to launch my wsgi app\\). So the idea is to have something that closely resemble PHP way of executing the application. Don't ask me why, just for fun. I use Django or Flask for real thing.  \n  \nSo here's my application defined in ../app/php.py:-  \n  \n  \nclass PHPApplication\\(object\\):  \ndef \\_\\_init\\_\\_\\(self\\):  \nself.out = \\[\\]  \nself.counter = 0  \nself.counter += 1  \nself.out.append\\(str\\(self.counter\\)\\)  \n  \ndef printx\\(self, out\\):  \nself.out.append\\(out\\)  \n  \ndef \\_\\_call\\_\\_\\(self, environ, start\\_response\\):  \nstart\\_response\\('200 OK', \\[\\('Content-type', 'text/html'\\)\\]\\)  \nfor out in self.out:  \nyield out  \n  \n  \nand the index.py:-  \n  \n  \nimport os  \nimport sys  \n  \nCUR\\_DIR = os.path.abspath\\(os.path.dirname\\(\\_\\_file\\_\\_\\)\\)  \nLIB\\_DIR = os.path.abspath\\(os.path.join\\(CUR\\_DIR, '../lib'\\)\\)  \nAPP\\_DIR = os.path.abspath\\(os.path.join\\(CUR\\_DIR, '../app'\\)\\)  \n  \nfor path in \\(LIB\\_DIR, APP\\_DIR,\\):  \nif path not in sys.path:  \nsys.path.insert\\(0, path\\)  \n  \nfrom php import PHPApplication  \n  \nphp = PHPApplication\\(\\)  \nphp.printx\\(\"hello world\"\\)  \n  \napplication = php  \n  \n  \nand the apache vhost config:-  \n  \nDocumentRoot /home/kamal/pylikephp/htdocs  \nDirectoryIndex index.py  \n  \nOptions ExecCGI  \n  \nAddHandler wsgi-script .py  \n  \nOrder allow,deny  \nAllow from all  \n  \n  \nWSGIDaemonProcess pylikephp processes=1 threads=2 display-name=%\\{GROUP\\}  \nWSGIProcessGroup pylikephp  \n  \n  \nMy initial thought was the counter will always get incremented since the application object was created only once during mod\\_wsgi daemon process initialization. But it look like the application object is created on each requests since the counter always stayed at 1 even after refreshing my browser few times. What I'm missing here.  \n  \nIf this is how mod\\_wsgi work, does it safe to build my application like this ?",
      "timestamp": "April 8, 2012 at 8:25 PM",
      "permalink": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html?showComment=1333880724418#c4765405698723870064",
      "is_blog_author": false
    },
    {
      "comment_id": "5116661591048165992",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@kamal Use the mod\\_wsgi mailing list to ask questions. Blog posts are not support forums.",
      "timestamp": "April 9, 2012 at 9:21 AM",
      "permalink": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html?showComment=1333927289413#c5116661591048165992",
      "is_blog_author": true
    }
  ],
  "labels": [
    "python",
    "wsgi"
  ],
  "metadata": {
    "published_timestamp": "2011-01-05T15:53:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Implementing WSGI application objects.",
    "og_title": "Implementing WSGI application objects.",
    "og_description": "Per the WSGI specification, an application object used as the entry point for requests is described as follows: \"\"\"The application object is...",
    "og_url": "http://blog.dscpl.com.au/2011/01/implementing-wsgi-application-objects.html"
  },
  "downloaded_images": []
}