{
  "title": "Using mod_wsgi-express with Django.",
  "content": "In my [last post](/posts/2015/04/introducing-modwsgi-express/) I finally officially introduced [mod\\_wsgi-express](https://pypi.python.org/pypi/mod_wsgi), an extension to mod\\_wsgi that I have been working on over the past year and a half. The purpose of mod\\_wsgi-express is to radically simplify the steps required to deploy a Python WSGI application using Apache and mod\\_wsgi. In that post I introduced some of the basic functionality of mod\\_wsgi-express. As Django is the most popular Python web framework, in this post I want to explain what is involved in using mod\\_wsgi-express with Django.\n\n# The structure of a Django project\n\nWhen starting a new Django project the ‘startproject’ command is supplied to the ‘django-admin’ script to create the initial project structure. The directories and files created in the directory where the command is run is:\n\n```\n    mysite/manage.py  \n    mysite/mysite/__init__.py  \n    mysite/mysite/settings.py  \n    mysite/mysite/urls.py  \n    mysite/mysite/wsgi.py\n```\n\nThe immediate subdirectory created below where the ‘startproject’ command was run, and which contains the ‘manage.py’ script, is referred to as the base directory. The name of the base directory is whatever you called the name of your project.\n\nThe ‘manage.py’ file contained in the base directory is a site specific variant of the ‘django-admin’ script, which provides a means of executing various builtin Django admin commands against your site, as well as any admin commands which may later be added to the site by associating add-on applications with it.\n\nIn addition to the ‘manage.py’ script a further subdirectory, with the same name as the base directory, will have been created. This directory will contain the actual code for your site. Worth noting is that this directory actually contains an ‘\\_\\_init\\_\\_.py’ file. This is important as it actually marks the directory as a Python package, rather than just a collection of Python modules.\n\nThis directory also contains two other files which are important and come into play when aiming to deploy your site. These are the ‘settings.py’ file, which is used to customise the capabilities of your site and how it may be made available, plus the ‘wsgi.py’ file, which contains the WSGI application entry point which any WSGI server needs to know about. It is the function or other callable object specified as the WSGI application entry point to which the details of each request received by the WSGI server will be passed to have your Django application serve the request.\n\nAs far as now using mod\\_wsgi-express with such a Django project, there are two main things that mod\\_wsgi-express needs to be told. These are the location of the base directory and the full name of the module containing the WSGI application entry point.\n\nThe location of the base directory is important because it is the parent directory for the Python package containing the code for your site. This directory will need to be added to the Python module search path so the Python package containing your site code can be found. In particular we need it to be able to find the ‘wsgi.py’ file when referring to it via its full module name.\n\nSo if we were still located in the top level directory where the ‘startproject’ command was run, one above the base directory, we would run ‘mod\\_wsgi-express’ as:\n\n```\n    mod_wsgi-express start-server --working-directory mysite --application-type module mysite.wsgi\n```\n\nIf we had instead run mod\\_wsgi-express inside of the base directory, we could have used just:\n\n```\n    mod_wsgi-express start-server --application-type module mysite.wsgi\n```\n\nThe later still works because the working directory will be set to be the current directory if none is explicitly supplied.\n\nFor a simple hello world program that returns plain text, this is all that is required. If however you also have static media files for CSS stylesheets, Javascript and images, then this is not sufficient. This is readily apparent if you were to visit the ‘/admin’ URL of your site as no styling will be applied to what is displayed in the browser.\n\nTo have such styling applied for the ‘/admin’ URL, we also need to tell mod\\_wsgi-express about the location of any static media files and at what sub URL they need to be made available so that they can be found by any HTTP client.\n\n# Hosting of static media files\n\nWhen using Django’s own builtin development server, it will automatically make available any static media files at the required sub URL. When you use a separate WSGI server however, that automatic mapping and hosting of the static media files will not occur.\n\nIt is possible to configure Django to host these static media files itself even in a production setting, but this is sub optimal and not recommended. Instead such static media files should be hosted by a proper web server.\n\nIn the case of mod\\_wsgi-express, because it is actually using Apache underneath, then we already have a true web server available which can be used to host the static media files in a production setting.\n\nBefore we can make use of that capability though, we first need to setup the Django project to allow us to easily collect together all the static media files together in the one location. This is necessary as normally such static media files are spread out across different locations, including as part of Django itself, or any installed add-on applications.\n\nThe first thing we therefore need to do is modify the ‘settings.py’ file and add the setting:\n\n```\n    STATIC_ROOT = os.path.join(BASE_DIR, 'static')\n```\n\nThis is best placed at the end of the ‘settings.py’ file immediately after the existing setting for ‘STATIC\\_URL’.\n\nWhat the ‘STATIC\\_ROOT’ setting does is say that all static media files are to be placed into a directory called ‘static’ located within the base directory.\n\nTo actually get the files copied into that location we now need to run:\n\n```\n    python manage.py collectstatic\n```\n\nNote that although we run this initially, this command must be run every time any update is made to static media files located within any add-on applications, or were Django itself updated to a newer version\n\nAfter having run this command, this will now leave us with:\n\n```\n    mysite/manage.py  \n    mysite/mysite/__init__.py  \n    mysite/mysite/settings.py  \n    mysite/mysite/urls.py  \n    mysite/mysite/wsgi.py  \n    mysite/static/admin/css/...  \n    mysite/static/admin/img/...  \n    mysite/static/admin/js/...\n```\n\nSo the ‘static’ subdirectory has been created, with a further subdirectory containing the static media files for the admin component of Django implementing the ‘/admin’ sub URL.\n\nNow running mod\\_wsgi-express from within the base directory we would use:\n\n```\n    mod_wsgi-express start-server --url-alias /static static --application-type module mysite.wsgi\n```\n\nThe new option in this command is ‘—url-alias’. This option takes two arguments. The first is the sub URL where the static media files are to be made available. This should match the value which the ‘STATIC\\_URL’ setting had been set to. The second argument is the location of the directory where the static media files were copied. As we are running this command in the base directory and the location of the static media files is an immediate subdirectory, we can specify this as just the name of the subdirectory.\n\nWe should now have a working Django site using Apache/mod\\_wsgi. We have though had to duplicate certain information on the command line which is actually available in the Django settings file. The next step therefore is to eliminate that requirement by integrating mod\\_wsgi-express into the Django site itself as a Django admin management command. I will cover how that is done in the next blog post about this topic.",
  "date": "2015-04-05",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html",
  "post_id": "4032251770976665978",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "6329846844979422824",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/04421255312486381176",
      "author_profile_id": "04421255312486381176",
      "content": "I am currently in the process of deploying my first django project into our prod env. I'm amazed that this seemingly easy method of deployment with python/django is only 2\\(\\!\\) days old. What has the python community been up to until now? Is this a reliable way to go forward with our deployment or should I look elsewhere for a more tried and tested source?",
      "timestamp": "April 7, 2015 at 10:47 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1428410837817#c6329846844979422824",
      "is_blog_author": false
    },
    {
      "comment_id": "8894379516340913219",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "The pip installable mod\\_wsgi with mod\\_wsgi-express has been available for a year and has been working/usable during that whole time. Also remember it is based on mod\\_wsgi which is 8 years old.  \n  \nBeen too busy working on new stuff to bother announcing mod\\_wsgi-express on my blog. I have talked about it at conferences though.  \n  \nAs far as using it in production, what is lacking is the documentation of the best way of doing that. Will be blogging about that in coming weeks.",
      "timestamp": "April 8, 2015 at 8:53 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1428447213523#c8894379516340913219",
      "is_blog_author": true
    },
    {
      "comment_id": "7988848268861619732",
      "author": "Mayank",
      "author_url": "https://www.blogger.com/profile/03399560408217023819",
      "author_profile_id": "03399560408217023819",
      "content": "This was an extremely useful post. With some difficulty with static files I was able to get this going.  \n  \nI was wondering what do we do about media files and protected files with mod\\_wsgi-express. Do we have separate option or can we use --url-alias itself.  \n  \nKindly advise.  \n  \nThanks in advance,  \nMayank",
      "timestamp": "June 4, 2016 at 8:45 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1465037148877#c7988848268861619732",
      "is_blog_author": false
    },
    {
      "comment_id": "2013105041044030713",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Dodo Best to post your question on the mod\\_wsgi mailing list. It depends on what you mean by protected.",
      "timestamp": "June 7, 2016 at 10:15 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1465258502766#c2013105041044030713",
      "is_blog_author": true
    },
    {
      "comment_id": "535911921592377635",
      "author": "Mayank",
      "author_url": "https://www.blogger.com/profile/03399560408217023819",
      "author_profile_id": "03399560408217023819",
      "content": "Sorry. Missed updating here. I had to use an extra --url-alias /media /path/to/media for the user uploaded media files. Protected was for those files that are visible only to specific users. I realized that those don't need a mention on the command line. Now the setup works beautifully.  \n  \nI am struggling to make the debugger work as per a comment on your other post with mod\\_wsgi-express. Will post there if still stuck.  \n  \nThanks,  \nMayank",
      "timestamp": "June 7, 2016 at 9:07 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1465297636831#c535911921592377635",
      "is_blog_author": false
    },
    {
      "comment_id": "4424383484963351622",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/09626212296904827053",
      "author_profile_id": "09626212296904827053",
      "content": "Graham hello am with my first project with django and I tell you that I have 2 days trying to run it on apache .. I started doing it by installing and configuring apache mod\\_wgsi in the same apache to run my django project which unfortunately fails to do this morning in my I see this other method work mod\\_wgsi express just get home started in an attempt to ride I think ye come a long way since achieving install everything according to parameters set in my virtual environment where I stayed in my project .... but right now I an error that I can not solve ... run my server with the following command \\(mod\\_wsgi start-server-express --application-type module yarv1.wsgi\\) the server starts without any warning or apparent problem ... but when I try to access \\(http://127.0.0.1:8000/home/\\) skips a 500 error page not found and when I see in the log out the following \\(Exception occurred processing WSGI script '/ tmp / mod\\_wsgi-localhost: 8000: 1000 / htdocs /home'. \\) You think I have something misconfigured could help in this case I remain attentive greetings  \n  \npd: sorry if my English is bad'm using a translator",
      "timestamp": "June 9, 2016 at 1:12 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1465441972354#c4424383484963351622",
      "is_blog_author": false
    },
    {
      "comment_id": "7180767998387853942",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "If you need help, please use the mod\\_wsgi mailing list, or if you can't use that, the issue tracker on github for mod\\_wsgi.  \n  \nhttp://modwsgi.readthedocs.io/en/develop/finding-help.html  \n  \nComments on a blog post is not a suitable place to discuss problems in any depth.",
      "timestamp": "June 9, 2016 at 1:15 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1465442140290#c7180767998387853942",
      "is_blog_author": true
    },
    {
      "comment_id": "1288004199834432446",
      "author": "SiD",
      "author_url": "https://www.blogger.com/profile/03300234699947635177",
      "author_profile_id": "03300234699947635177",
      "content": "HI when setting up django using python manage.py runmodwsgi --setup-only option, the apachectl script that gets generated does not contain the path to apache shared libraries. SHLIBPATH is empty string. As a result apache complains about not finding .so files.  \n  \nI had to manually point the SHLIBPATH to \"~/project/venv/lib/python3.5/site-packages/mod\\_wsgi\\_packages/httpd/lib\"  \n  \nPlease fix this.",
      "timestamp": "October 19, 2016 at 3:15 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1476850510646#c1288004199834432446",
      "is_blog_author": false
    },
    {
      "comment_id": "6106352898962259865",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@SID The issue tracker for mod\\_wsgi can be found at:  \n  \n\\* https://github.com/GrahamDumpleton/mod\\_wsgi/issues  \n  \nPlease report the issue there.",
      "timestamp": "October 19, 2016 at 3:25 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1476851131257#c6106352898962259865",
      "is_blog_author": true
    },
    {
      "comment_id": "8410895007740573866",
      "author": "KR",
      "author_url": "https://www.blogger.com/profile/08108158001629157809",
      "author_profile_id": "08108158001629157809",
      "content": "why i cannot use mod\\_wsgi-express start-server  \nit said i can only use commands module-config and module-location  \nstart-server is one invalid command",
      "timestamp": "February 24, 2017 at 10:33 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1487936022205#c8410895007740573866",
      "is_blog_author": false
    },
    {
      "comment_id": "8630559199953888200",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@KR Because you are using Windows. On Windows you must still configure Apache yourself. You cannot use mod\\_wsgi-express start-server.  \n  \nOn Windows you still use pip install mod\\_wsgi because it is the easiest way to build mod\\_wsgi on Windows now. You then need to run 'mod\\_wsgi-express module-config'. This will output what you need to manually put in the Apache configuration to load mod\\_wsgi. Then you need to also manually configure Apache to host your specific WSGI application.  \n  \nIt is not know whether 'mod\\_wsgi-express start-server' can ever be made to work on Windows.  \n  \nFor more information on manual integration, see section 'Connecting into Apache installation' of:  \n  \nhttps://pypi.python.org/pypi/mod\\_wsgi",
      "timestamp": "February 24, 2017 at 10:39 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1487936342590#c8630559199953888200",
      "is_blog_author": true
    },
    {
      "comment_id": "7149646764924426053",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/10791282843164545047",
      "author_profile_id": "10791282843164545047",
      "content": "Hi Graham  \nI use mod\\_wsgi-express with django and run server like this manage.py runmodwsgi ...  \nI have a question about logging.  \nWhen python traceback appears in error\\_log, mod\\_wsgi add timestamp and other information to every line and it's a problem because i sent logs to logstash server and it's splited to many events. Can i somehow use python logger instead of wsgi or use both just devide logs to different files?  \nThanks in advance",
      "timestamp": "March 24, 2017 at 6:43 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1490341429408#c7149646764924426053",
      "is_blog_author": false
    },
    {
      "comment_id": "9090160611058126678",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/10791282843164545047",
      "author_profile_id": "10791282843164545047",
      "content": "This comment has been removed by a blog administrator.",
      "timestamp": "March 24, 2017 at 6:45 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1490341544899#c9090160611058126678",
      "is_blog_author": false
    },
    {
      "comment_id": "5247755908434742114",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "For questions you should use the mod\\_wsgi mailing list.   \n  \nhttp://modwsgi.readthedocs.io/en/develop/finding-help.html  \n  \nAnyway, best you might do is use the --error-log-format option to change the log format to drop the timestamps etc. I don't think this will help you though, because the real issue is probably going to be that each traceback stack frame is output on a separate line. If that is true, using the logging module isn't going to help you either.",
      "timestamp": "March 24, 2017 at 7:25 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1490343906396#c5247755908434742114",
      "is_blog_author": true
    },
    {
      "comment_id": "2060269449324544724",
      "author": "Artemedu",
      "author_url": "https://www.blogger.com/profile/13140776546968751541",
      "author_profile_id": "13140776546968751541",
      "content": "Hello Graham\\!  \nPlease explain at a high level how the mod\\_wsgi\\_express works. Does it create a new independent virtual Apache server running my application\\(s\\)? And if so, is it secure to stop principal Apache server, i.e. will my python/Django-based app still be working in mod\\_wsgi/apache if I close the principal Apache server? Thanks in advance.",
      "timestamp": "August 12, 2017 at 8:08 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1502489310564#c2060269449324544724",
      "is_blog_author": false
    },
    {
      "comment_id": "4109413545196054381",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Artemedu For some context, watch https://www.youtube.com/watch?v=H6Q3l11fjU0  \n  \nYou must still have Apache runtime and dev packages installed for system, but does not need to be enabled. Uses separate configuration files.",
      "timestamp": "August 12, 2017 at 8:50 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1502491831203#c4109413545196054381",
      "is_blog_author": true
    },
    {
      "comment_id": "4248719239669794554",
      "author": "Artemedu",
      "author_url": "https://www.blogger.com/profile/13140776546968751541",
      "author_profile_id": "13140776546968751541",
      "content": "Graham, thank you\\! This is exactly what I wanted to know. BTW, I have already installed mod\\_wsgi-express server and my app works good with it. But my IT manager asked me to stop \\(not uninstall, just stop\\) Apache server for security reason, so that it doesn't use another port. And I was wondering if my app will still be working after that. Now I know that it should be working. Thank you\\!",
      "timestamp": "August 13, 2017 at 4:19 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1502561987351#c4248719239669794554",
      "is_blog_author": false
    },
    {
      "comment_id": "2130500056279468036",
      "author": "Artemedu",
      "author_url": "https://www.blogger.com/profile/13140776546968751541",
      "author_profile_id": "13140776546968751541",
      "content": "Hello Graham\\! Is it possible to run modwsgi in another folder rather than defined one?  \nCurrently, I run Apache instance with modwsgi with the following command:  \npython manage.py runmodwsgi  \nAnd my apache/modwsgi instance get run in tmp/mod\\_wsgi-localhost:8000:1000/  \nEverything works fine one week but then it seems that operating system cleans/deletes some of files including htdocs folder since I am not an owner of this tmp/ directory.  \n  \nSo, if there is a way to run modwsgi in another folder with a command like:  \npython manage.py runmodwsgi --server-root=/full path to desired folder/  \nThank you.",
      "timestamp": "September 12, 2017 at 10:35 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1505219700253#c2130500056279468036",
      "is_blog_author": false
    },
    {
      "comment_id": "908613053693636268",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "Using --server-root with runmodwsgi is fine, and is shown as an example in https://pypi.python.org/pypi/mod\\_wsgi",
      "timestamp": "September 12, 2017 at 10:36 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1505219817579#c908613053693636268",
      "is_blog_author": true
    },
    {
      "comment_id": "5257080576403150177",
      "author": "Artemedu",
      "author_url": "https://www.blogger.com/profile/13140776546968751541",
      "author_profile_id": "13140776546968751541",
      "content": "Graham, Thank you\\! I saw examples shown at this link but since they refer to section named as 'running mod\\_wsgi-express as root' and I don't have root privileges, I wasn't sure if this command \\(--server-root\\) can be used in my case.",
      "timestamp": "September 13, 2017 at 12:18 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1505225924467#c5257080576403150177",
      "is_blog_author": false
    },
    {
      "comment_id": "5572208224682769179",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Artemedu As long as you have write permission to create the directory you pass to --server-root, or it already exists and you have write access, you are good.",
      "timestamp": "September 13, 2017 at 11:07 AM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1505264829882#c5572208224682769179",
      "is_blog_author": true
    },
    {
      "comment_id": "7005496245808154793",
      "author": "Roxolan",
      "author_url": "https://www.blogger.com/profile/13265667385516076321",
      "author_profile_id": "13265667385516076321",
      "content": "Hello, Graham\\!  \nI am trying to deploy django with mod\\_wsgi \\(I watched your PyCone speech on youtube\\).   \nI've installed packages and executed:  \n.env/bin/python manage.py runmodwsgi --server-root /etc/wsgi-port-80 --user www-data --group www-data --host www.example-my.com --setup-only  \nThan   \n/etc/wsgi-port-80/apachectl start  \nand get an error  \n\\[Wed Oct 18 14:56:00.989197 2017\\] \\[core:crit\\] \\[pid 10141:tid 140533963185280\\] \\(EAI 2\\)Name or service not known: AH00077: alloc\\_listener: failed to set up sockaddr for www.example-my.com  \nAH00526: Syntax error on line 21 of /etc/wsgi-port-80/httpd.conf:  \nListen setup failed  \nAs I understood, these commands create a valid httpd.conf.  \nI can't unserstand what I do wrong.  \n  \nThanks in advance",
      "timestamp": "October 18, 2017 at 11:03 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1508328187268#c7005496245808154793",
      "is_blog_author": false
    },
    {
      "comment_id": "7906066907227519556",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Roxolan  \n  \nThe likely reason though is that you don't need '--host www.example-my.com' unless you are going to enable secure access. Whatever you do use for that must be a valid hostname which can be mapped to an IP. Likely what you are using isn't.  \n  \nIf you have further questions, please using the mod\\_wsgi mailing list as described in:  \n  \n\\* http://modwsgi.readthedocs.io/en/develop/finding-help.html  \n  \nOr if for some reason you can't use the mailing list, ask your question on StackOverflow.",
      "timestamp": "October 18, 2017 at 11:08 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1508328513598#c7906066907227519556",
      "is_blog_author": true
    },
    {
      "comment_id": "3288601085761924711",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "@Roxolan Also, if you really did want to use port 80, you are missing the '--port 80' option.",
      "timestamp": "October 18, 2017 at 11:09 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1508328573431#c3288601085761924711",
      "is_blog_author": true
    },
    {
      "comment_id": "1937694547043518247",
      "author": "Roxolan",
      "author_url": "https://www.blogger.com/profile/13265667385516076321",
      "author_profile_id": "13265667385516076321",
      "content": "@GrahamDumpleton  \nThank you for your answer.",
      "timestamp": "October 18, 2017 at 11:41 PM",
      "permalink": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html?showComment=1508330488404#c1937694547043518247",
      "is_blog_author": false
    }
  ],
  "labels": [
    "apache",
    "django",
    "mod_wsgi",
    "python",
    "wsgi"
  ],
  "metadata": {
    "published_timestamp": "2015-04-05T23:22:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Using mod_wsgi-express with Django.",
    "og_title": "Using mod_wsgi-express with Django.",
    "og_description": "In my last post  I finally officially introduced mod_wsgi-express , an extension to mod_wsgi that I have been working on over the past year ...",
    "og_url": "http://blog.dscpl.com.au/2015/04/using-modwsgi-express-with-django.html"
  },
  "downloaded_images": []
}