{
  "title": "Content length and wsgi.file_wrapper.",
  "content": "Following on from the previous post about the close\\(\\) method and wsgi.file\\_wrapper, I am now going to deal with issues around the ‘Content-Length’ header in responses when dealing with wsgi.file\\_wrapper.  \n  \nWhen returning a response from a WSGI application, the ‘Content-Length’ header can be specified to indicate how much data is being returned in the body of the response. To be in compliance with HTTP specifications, you should only return that amount of data. In PEP 333, the original specification for WSGI, this wasn’t clearly spelt out and there were other statements which could be seen as creating situations which conflicted with that requirement.  \n  \nSpecifically, in PEP 333 the way in which an instance of wsgi.file\\_wrapper was dealt with was explained as:  \n  \n\"\"\"Apart from the handling of close\\(\\), the semantics of returning a file wrapper from the application should be the same as if the application had returned iter\\(filelike.read, ''\\). In other words, transmission should begin at the current position within the \"file\" at the time that transmission begins, and continue until the end is reached.\"\"\"  \n  \nThe problem here is if a WSGI application returns an instance of wsgi.file\\_wrapper, but sets a ‘Content-Length’ response header with a value which is less than the actual length of the filelike object used, then because the WSGI specification was indicating that all content from the filelike object should be returned, then one could actually end up with more data being returned than that specified by the ‘Content-Length’ header.\n    \n    \n```\ndef application(environ, start_response):  \n    status = '200 OK'  \n```\n      \n```\n    filelike = file('/usr/share/dict/words', 'r')  \n```\n      \n```\n    blksize = 8192  \n    filesize = 1024  \n```\n      \n```\n    response_headers = [('Content-Type', 'text/plain'),  \n                        (‘Content-Length’, str(filesize)),]  \n    start_response(status, response_headers)  \n```\n      \n```\n    file_wrapper = environ.get('wsgi.file_wrapper', None)  \n```\n      \n```\n    if file_wrapper:  \n        return file_wrapper(filelike, blksize)  \n    else:  \n        return iter(lambda: filelike.read(blksize), '')\n```\n\nThis issue in the WSGI specification was remedied in the PEP 3333 update to PEP 333 where it clearly spells out that in general:  \n  \n\"\"\"If the application supplies a Content-Length header, the server should not transmit more bytes to the client than the header allows, and should stop iterating over the response when enough data has been sent, or raise an error if the application tries to write\\(\\) past that point. \\(Of course, if the application does not provide enough data to meet its stated Content-Length, the server should close the connection and log or otherwise report the error.\\)\"\"\"  \n  \nFurther, in relation to wsgi.file\\_wrapper it now instead says:  \n  \n\"\"\"Apart from the handling of close\\(\\), the semantics of returning a file wrapper from the application should be the same as if the application had returned iter\\(filelike.read, ''\\). In other words, transmission should begin at the current position within the \"file\" at the time that transmission begins, and continue until the end is reached, or until Content-Length bytes have been written. \\(If the application doesn't supply a Content-Length, the server may generate one from the file using its knowledge of the underlying file implementation.\\)\"\"\"  \n  \nSo, the WSGI server or gateway is now clearly required to protect against more data than is specified by the ‘Content-Length’ response header being written back to the HTTP client.  \n  \nThis though doesn’t indicate that any WSGI middleware is effectively bound by the same requirement. Unfortunately you generally never see WSGI middleware check what ‘Content-Length’ may already be set to and restrict how much data they consume from a WSGI component it is wrapping. This results in incorrect output for some types of WSGI middleware.  \n  \nTake the GzipResponse middleware from Paste as an example. This WSGI middleware performs compression on any response data. The middleware provides its own start\\_response\\(\\) stand in which does the following:\n    \n    \n```\ndef gzip_start_response(self, status, headers, exc_info=None):  \n    self.headers = headers  \n    ct = header_value(headers,'content-type')  \n    ce = header_value(headers,'content-encoding')  \n    self.compressible = False  \n    if ct and (ct.startswith('text/') or \\  \n        ct.startswith('application/')) and 'zip' not in ct:  \n        self.compressible = True  \n    if ce:  \n        self.compressible = False  \n    if self.compressible:  \n        headers.append(('content-encoding', 'gzip'))  \n    remove_header(headers, 'content-length')  \n    self.headers = headers  \n    self.status = status  \n    return self.buffer.write\n```\n\nThe code in this case removes the ‘Content-Length’ header from the response headers but you will note that it doesn’t actually pay attention to what the original value of the ‘Content-Length’ header was and limit itself to only consuming that much data from the enclosed WSGI application component.\n    \n    \n```\ndef finish_response(self, app_iter):  \n    if self.compressible:  \n        output = gzip.GzipFile(mode='wb',  \n            compresslevel=self.compress_level,  \n            fileobj=self.buffer)  \n    else:  \n        output = self.buffer  \n    try:  \n        for s in app_iter:  \n            output.write(s)  \n        if self.compressible:  \n            output.close()  \n    finally:  \n        if hasattr(app_iter, 'close'):  \n            app_iter.close()  \n    content_length = self.buffer.tell()  \n    CONTENT_LENGTH.update(self.headers, content_length)  \n    self.start_response(self.status, self.headers)\n```\n\nThis means that for our original example where a ‘Content-Length’ of 1024 had been specified, but where the actual file could have been much much bigger, that the GzipResponse middleware will consume the complete file instead and not limit it to 1024 bytes. In the end, this middleware could end up actually setting ‘Content-Length’ to be a larger value than it even was originally, due to the inclusion of data in the output which was not intended to be included.  \n  \nYes it would be nice to see WSGI middleware do the correct thing, but reality is that not everyone is going to get WSGI middleware correct. As a result, the better solution here in relation to wsgi.file\\_wrapper, is for a future revision of the WSGI specification to be amended so as to allow a ‘filesize’ argument to optionally be provided to wsgi.file\\_wrapper.  \n  \nBy doing this it puts control of how much data is returned from the iterable produced by wsgi.file\\_wrapper in the hands of the code which is invoking wsgi.file\\_wrapper in the first place, rather than relying on WSGI middleware to be implemented properly.  \n  \nSo, where as the FileWrapper class type previously may have been implemented as:\n    \n    \n```\nclass FileWrapper:  \n    def __init__(self, filelike, blksize=8192):  \n        self.filelike = filelike  \n        self.blksize = blksize  \n        if hasattr(filelike, 'close'):  \n            self.close = filelike.close  \n    def __getitem__(self, key):  \n        data = self.filelike.read(self.blksize)  \n        if data:  \n            return data  \n        raise IndexError\n```\n\nit would instead be implemented as:\n    \n    \n```\nclass FileWrapper:  \n    def __init__(self, filelike, blksize=8192, filesize=-1):  \n        self.filelike = filelike  \n        self.blksize = blksize  \n        self.filesize = filesize  \n        if hasattr(filelike, 'close'):  \n            self.close = filelike.close  \n    def __getitem__(self, key):  \n        if self.filesize < 0:  \n            data = self.filelike.read(self.blksize)  \n            if data:  \n                return data  \n        elif self.filesize > 0:  \n            blksize = self.blksize  \n            if blksize > self.filesize:  \n                blksize = self.filesize  \n            data = self.filelike.read(blksize)  \n            self.filesize -= len(data)  \n            if data:  \n                return data  \n        raise IndexError\n```\n\nOur original example could then be reimplemented as:\n    \n    \n```\ndef application(environ, start_response):  \n    status = '200 OK'  \n```\n      \n```\n    filelike = file('/usr/share/dict/words', 'r')  \n```\n      \n```\n    blksize = 8192  \n    filesize = 1024  \n```\n      \n```\n    response_headers = [('Content-Type', 'text/plain'),  \n                        (‘Content-Length’, str(filesize)),]  \n    start_response(status, response_headers)  \n```\n      \n```\n    file_wrapper = environ.get('wsgi.file_wrapper', None)  \n```\n      \n```\n    if file_wrapper:  \n        return file_wrapper(filelike, blksize, filesize)  \n    else:  \n        return iter(lambda: filelike.read(blksize), '')\n```\n\nEven though the file size is now being passed as a parameter, we still need to set the ‘Content-Length’ header in the response for completeness. This is because the only situation where it may be set for us, if is the WSGI gateway did actually decide to implement platform specific optimisations for wsgi.file\\_wrapper and set it for us, but even that is not guaranteed. We have at least though ensured that any WSGI middleware will only consume as much of the iterable created by wsgi.file\\_wrapper as we may want it to and not produce an entirely incorrect result.  \n  \nLook closely though and we still have problems where a platform doesn’t provide wsgi.file\\_wrapper, at least with the simplistic alternative shown using iter and lambda. This is because that code is still going to read to the end of the file rather than it being restricted to how much data we want it to be able to read.  \n  \nThis means that if wsgi.file\\_wrapper is going to continue to be optional, we have to always also provide our own implementation of the FileWrapper class as shown above and use it as:\n    \n    \n```\nif file_wrapper:  \n    return file_wrapper(filelike, blksize, filesize)  \nelse:  \n    return FileWrapper(filelike, blksize, filesize)\n```\n\nThat is plain stupid, especially since people may not realise the importance of implementing a file wrapper with a size restriction when they aren’t wanting to return the complete contents of the file or where it is possible the amount of data in the file could change.  \n  \nIt is therefore suggested that in addition to the file size being able to be specified to wsgi.file\\_wrapper, that it be made mandatory that wsgi.file\\_wrapper be supplied.  \n  \nThis should be the case even if a specific WSGI gateway or adapter cannot provide an optimised way for delivering the file back to the client. In this case it would simply provide the FileWrapper implementation described here as wsgi.file\\_wrapper instead, thereby avoiding users having to provide their own all the time.  \n  \nThe code could thus be simplified to:\n    \n    \n```\ndef application(environ, start_response):  \n    status = '200 OK'  \n```\n      \n```\n    filelike = file('/usr/share/dict/words', 'r')  \n```\n      \n```\n    blksize = 8192  \n    filesize = 1024  \n```\n      \n```\n    response_headers = [('Content-Type', 'text/plain'),  \n                        (‘Content-Length’, str(filesize)),]  \n    start_response(status, response_headers)  \n```\n      \n```\n    file_wrapper = environ['wsgi.file_wrapper']  \n```\n      \n```\n    return file_wrapper(filelike, blksize, filesize)\n```\n\non the basis that wsgi.file\\_wrapper would always exist. So, one less thing for programmers of WSGI applications to worry about and get wrong and a bit less of a burden on implementors of WSGI middleware as well.",
  "date": "Wednesday, January 5, 2011",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2011/01/content-length-and-wsgifilewrapper.html",
  "post_id": "8802232990230740588",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "9090474024202356978",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "If you have any comments about the topic of this post, you are best probably taking up the issue on the Python WEB-SIG mailing list. Be aware that this post is only one of a series of posts about wsgi.file\\_wrapper issues and potential remedies. To solve some of the short comings of wsgi.file\\_wrapper is going to need a refactoring of the current WSGI specification at a basic level, so you may want to wait until the whole series of posts about wsgi.file\\_wrapper issues has been completed before commenting.",
      "timestamp": "January 5, 2011 at 9:59 PM",
      "permalink": "http://blog.dscpl.com.au/2011/01/content-length-and-wsgifilewrapper.html?showComment=1294225161688#c9090474024202356978",
      "is_blog_author": true
    }
  ],
  "labels": [
    "python",
    "wsgi"
  ],
  "metadata": {
    "published_timestamp": "2011-01-05T21:54:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Content length and wsgi.file_wrapper.",
    "og_title": "Content length and wsgi.file_wrapper.",
    "og_description": "Following on from the previous post about the close() method and wsgi.file_wrapper, I am now going to deal with issues around the ‘Content-L...",
    "og_url": "http://blog.dscpl.com.au/2011/01/content-length-and-wsgifilewrapper.html"
  },
  "downloaded_images": []
}