{
  "title": "How are you using Docker in your development workflow?",
  "content": "If you have been reading my blog posts rather than simply flicking them out of your news feed as a bit of noise, you will know that I have been working on a project which aims to make the deployment of Python web applications easier. I wrote a bit about this in the post titled '[Building a better user experience for deploying Python web applications](http://blog.dscpl.com.au/2016/02/building-better-user-experience-for.html)’.\n\nThat post got a surprising number of reads, many more than I would normally expect to see in such a short period of time. There definitely therefore seems to be a lot of interest in the topic.\n\nFor what I am developing I am targeting a local user development workflow where you work directly on your own computer, as well as then deploying direct to some host. At the same time though, I am providing a way to ease the transition to bundling up your application as a Docker image so that it can then be run using a Docker hosting service or a more comprehensive container application platform or PaaS.\n\nIn the workflow I am creating I am allowing for the ability to also iterate on changes to your code base while it is running inside of a Docker container. This is so that where your local development system is a different operating system to where it is deployed, you can still easily debug your code for the target system.\n\nPersonally I feel that most people will still likely develop on their own local system first, rather than doing development exclusively within Docker in some way.\n\nAlthough this is my view, I am very much interested in how others see Docker fitting into the development workflow when implementing Python web applications. So I would like to hear your feedback so I can factor in what people are actually doing, or what they want to be able to do, within the system I am creating.\n\nLuckily my colleague, the awesome Steve Pousty, has recently hosted up a survey asking similar questions about use of Docker in development.\n\nIt would help me immensely in what I am working on for Python if you could respond to Steve’s survey as then I can see what I can learn from the results as well. The survey is only short and should take as little as five minutes to fill in. You can take longer of course if you want to provide additional feedback on top of the short list of multiple choice questions.\n\nWhen done Steve will be collating and making available the results, so it should be an interesting set of results for anyone working in this space.\n\nYou can see Steve’s original blog post about the survey at:\n\n\\* [Input Request: How Do You Use Docker Containers For Your Local Development?](https://blog.openshift.com/input-request-use-docker-containers-local-development/)\n\nThe survey itself you can find over on Survey Monkey at:\n\n\\* <https://www.surveymonkey.com/r/dockerdev>\n\nIf you fill in the survey, make sure you mark Python in the languages you are using so I know what responses may be extra relevant to me. I would also be interested to know what Python WSGI server you are using, or whether you are using some ASYNC Python web server. So add that as extra information at the end of the survey.\n\nIn the system I am developing, I am trying to cater for all the main WSGI servers in use \\(gunicorn, mod\\_wsgi-express, uWSGI, Waitress\\), as well as providing ways of also running up other servers based on the ASYNC model. Knowing what servers you are using will therefore help me understand what else I should be supporting in the workflow.\n\nLooking forward to any comments you have. Thanks.",
  "date": "Friday, April 8, 2016",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2016/04/how-are-you-using-docker-in-your.html",
  "post_id": "7479924924581291295",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "6495967731466550238",
      "author": "Unknown",
      "author_url": "https://www.blogger.com/profile/14824694805745746190",
      "author_profile_id": "14824694805745746190",
      "content": "Steve's survey is already closed, but in the project I'm currently working on, there's a bunch of tests marked for execution with \"py.test -m offline\" that can be run directly on the host system in a Python virtual environment, and then a bunch more that rely on using docker-compose to run up a local server instance in mod\\_wsgi \\(including a Kerberos KDC with a dummy user configured\\) for API testing \\(including proper authentication testing\\)",
      "timestamp": "April 23, 2016 at 12:56 AM",
      "permalink": "http://blog.dscpl.com.au/2016/04/how-are-you-using-docker-in-your.html?showComment=1461337001307#c6495967731466550238",
      "is_blog_author": false
    }
  ],
  "labels": [
    "docker",
    "python"
  ],
  "metadata": {
    "published_timestamp": "2016-04-08T08:53:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: How are you using Docker in your development workflow?",
    "og_title": "How are you using Docker in your development workflow?",
    "og_description": "If you have been reading my blog posts rather than simply flicking them out of your news feed as a bit of noise, you will know that I have b...",
    "og_url": "http://blog.dscpl.com.au/2016/04/how-are-you-using-docker-in-your.html"
  },
  "downloaded_images": []
}