{
  "title": "Building a better user experience for deploying Python web applications.",
  "content": "Yet again I missed out on a getting a talk into PyCon US. The title of my proposed talk was the same as this blog post. Since it wasn’t accepted, I thought I might instead use a blog post to give a sneak peek at some of the more recent work I have been doing on Python web application deployment, which I otherwise would have described a bit about in my talk if it had been accepted.\n\nFor those who may have been following what I have been doing in the past with creating and supplying Docker images for running Python web applications using Apache and mod\\_wsgi, this is a progression of that work, expanding on the scope and making it usable beyond Docker containers.\n\n# Demonstration using Django\n\nTo illustrate what it is all about a simple demonstration is in order. For that lets create a new Django web application project and get it running.\n\n```python\n    $ django-admin startproject mydjangosite\n\n    $ cd mydjangosite/\n\n    $ python manage.py runserver  \n    Performing system checks...\n\n    System check identified no issues (0 silenced).\n\n    You have unapplied migrations; your app may not work properly until they are applied.  \n    Run 'python manage.py migrate' to apply them.\n\n    February 18, 2016 - 01:22:25  \n    Django version 1.9.2, using settings 'mydjangosite.settings'  \n    Starting development server at http://127.0.0.1:8000/  \n    Quit the server with CONTROL-C.\n```\n\nNothing special here and if we go to the URL ‘http://127.0.0.1:8000/admin' we will be presented with the login page for the Django admin interface. As we are using the builtin Django development server the styling for the login page will look correct as the development server automatically worries about static file assets such as style sheets.\n\nAs you should all hopefully know, the Django development server should not be used for a production system. For development though at least, the development server can be handy due to the fact that it does handle static file assets and also offers automatic code reloading. Use of the development server can though hide certain problems that will only occur in a production environment where a multi process and/or multi threaded configuration may be used.\n\nSetting up a production grade web server is often viewed as being a lot of trouble and people can struggle with it. Lets therefore see if we can make that a bit easier.\n\n# Simplified web application wrapper\n\nIn order to create that Django application above I first needed to have Django installed. This was simply so that the ‘django-admin’ program was available. Imagine though that I didn’t need that as I had created the project skeleton by hand, or had checked out an existing Django project repository. To emphasise this, lets use ‘virtualenvwrapper’ to create a fresh Python virtual environment. Into this I am going to install a single Python package called ‘warpdrive’.\n\n```bash\n    $ mkvirtualenv warpdrive  \n    New python executable in /Users/graham/Python/warpdrive/bin/python  \n    Installing setuptools, pip, wheel...done.  \n    virtualenvwrapper.user_scripts creating /Users/graham/Python/warpdrive/bin/predeactivate  \n    virtualenvwrapper.user_scripts creating /Users/graham/Python/warpdrive/bin/postdeactivate  \n    virtualenvwrapper.user_scripts creating /Users/graham/Python/warpdrive/bin/preactivate  \n    virtualenvwrapper.user_scripts creating /Users/graham/Python/warpdrive/bin/postactivate  \n    virtualenvwrapper.user_scripts creating /Users/graham/Python/warpdrive/bin/get_env_details  \n    \n    (warpdrive) $ pip install warpdrive  \n    Collecting warpdrive  \n    Installing collected packages: warpdrive  \n    Successfully installed warpdrive-0.14.6\n```\n\nWe will still need Django, but we definitely don’t want to install that manually as an argument to ‘pip’ on the command line. Instead we should list any such required Python packages in a ‘requirements.txt’ file for ‘pip’. We will therefore create a ‘requirements.txt’ file listing only ‘Django’ in it.\n\nEven now I still don’t really want to run ‘pip’ by hand as setting up a Python web application project so it can be run is often more than just installing required Python packages. For example, when using Django with a production grade WSGI server, it would generally be necessary to run ‘python manage.py collectstatic’. These are steps though that can be forgotten by users. A better approach would be to automate such steps, and where necessary, record such manual steps in special build scripts that would be automatically run when setting up the environment for running a Python web application. This is where ‘warpdrive’ comes into play.\n\nNow although I create a Python virtual environment and installed ‘warpdrive’, that was purely so that I had ‘warpdrive’ installed and show that otherwise I had an empty Python installation.\n\nWhat I am now going to do is build a separate Python virtual environment for this specific Python web application, but have ‘warpdrive’ create it and set it up for me.\n\n```python\n    (warpdrive) $ eval \"$(warpdrive activate mydjangosite)\" \n\n    (warpdrive+mydjangosite) $ warpdrive build  \n    -----> Installing dependencies with pip  \n    Collecting Django (from -r requirements.txt (line 1))  \n    Downloading Django-1.9.2-py2.py3-none-any.whl (6.6MB)  \n    100% |████████████████████████████████| 6.6MB 1.4MB/s  \n    Installing collected packages: Django  \n    Successfully installed Django-1.9.2  \n    Collecting mod-wsgi  \n    Installing collected packages: mod-wsgi  \n    Successfully installed mod-wsgi-4.4.22  \n    -----> Collecting static files for Django  \n    Copying ‘.../django/contrib/admin/static/admin/css/base.css’  \n    ...  \n    \n    56 static files copied to '/Users/graham/.warpdrive/warpdrive+mydjangosite/home/django_static_root'.\n```\n\nThe first step here was to use ‘warpdrive activate’ to create a fresh Python virtual environment and use it for the current shell. The second step was to use ‘warpdrive build’ to setup our environment.\n\nThe ‘warpdrive build’ command is doing a few things here, but the main things are that it installed all Python packages listed in the ‘requirements.txt’ file, installed ‘mod\\_wsgi-express’ and finally ran ‘python manage.py collectstatic’.\n\nYou may note that we didn’t actually specify that the Django management command ‘collectstatic’ should be executed. This is because ‘warpdrive’ itself knows about various ways that Python web applications may be launched, including special support for detecting when you are running a Django web application. Knowing that you are using Django it will automatically run ‘collectstatic’ for you.\n\nThe keen eyed may even notice that we didn’t modify the Django settings module and specify ‘STATIC\\_ROOT’ so that ‘collectstatic’ knew where to copy static file assets. Again this is the smarts of ‘warpdrive’ kicking in, with it realising that it wasn’t defined and supplying its own value of ‘STATIC\\_ROOT’ instead when ‘collectstatic' is run.\n\nAs you go along and make changes to static file assets or modify the ‘requirements.txt’ file, you simply need to re-run ‘warpdrive build’ to refresh the current environment.\n\nWith the environment for the web application built, we can now start it up. To do this we are going to use ‘warpdrive start'.\n\n```python\n    (warpdrive+mydjangosite) $ warpdrive start  \n    -----> Configuring for server type of auto  \n    -----> Running server script start-mod_wsgi  \n    -----> Executing server command ' mod_wsgi-express start-server --log-to-terminal --startup-log --port 8080 --application-type module --entry-point mydjangosite.wsgi --callable-object application --url-alias /static/ /Users/graham/.warpdrive/warpdrive+mydjangosite/home/django_static_root/'  \n    Server URL : http://localhost:8080/  \n    Server Root : /tmp/mod_wsgi-localhost:8080:502  \n    Server Conf : /tmp/mod_wsgi-localhost:8080:502/httpd.conf  \n    Error Log File : /dev/stderr (warn)  \n    Startup Log File : /dev/stderr  \n    Request Capacity : 5 (1 process * 5 threads)  \n    Request Timeout : 60 (seconds)  \n    Queue Backlog : 100 (connections)  \n    Queue Timeout : 45 (seconds)  \n    Server Capacity : 20 (event/worker), 20 (prefork)  \n    Server Backlog : 500 (connections)  \n    Locale Setting : en_AU.UTF-8  \n    [Thu Feb 18 12:58:37.279748 2016] [mpm_prefork:notice] [pid 9456] AH00163: Apache/2.4.16 (Unix) mod_wsgi/4.4.22 Python/2.7.10 configured -- resuming normal operations  \n    [Thu Feb 18 12:58:37.280085 2016] [core:notice] [pid 9456] AH00094: Command line: 'httpd (mod_wsgi-express) -f /tmp/mod_wsgi-localhost:8080:502/httpd.conf -E /dev/stderr -D FOREGROUND'\n```\n\nUnlike before, this time the Django development server is not being run. Instead ‘warpdrive’ is running ‘mod\\_wsgi-express’. In doing that it has automatically determined from the Django application itself what the WSGI application entry point is, where static files assets are mounted, as well as determine where the static file assets are located. Our style sheets for the Django admin page therefore work, even if you had forgot to set up ‘STATIC\\_ROOT’ in the Django settings file as ‘warpdrive’ would have detected that.\n\nWith no real extra work we have got ourselves a production grade WSGI server and can thus be more confident that we have something more comparable to when we really deploy our Django application. Notionally this could even be used as the basis of your production deployment and if it was, it means that your local environment is going to be as close as possible to the actual production platform.\n\nAs far as additional configuration or setup steps, ‘warpdrive’ supports various mechanisms for supplying hook scripts which can be executed as part of the build and deployment phases. This means you can capture setup steps and have them triggered on both a local environment and production where appropriate. Additional WSGI server options or environment variables can also be supplied to override or customise the configuration, such as tuning the number of processes and threads being used.\n\nOne specific environment variable relevant to local development is ‘MOD\\_WSGI\\_RELOAD\\_ON\\_CHANGES’. Define this when running ‘warpdrive start’ and you get back the automatic code reloading feature of the builtin Django development server, meaning you can just as readily use ‘warpdrive' during development also.\n\n# That cool kid called Docker\n\nYou may be saying, but I use Docker, so how is this going to help me.\n\nThis is no problem and ‘warpdrive’ actually grew out of all the work I have been doing with Docker. You could technically create your own Docker base image and provided it satisfies a few requirements around certain system packages being available, trigger ‘warpdrive build’ from your ‘Dockerfile’ and ‘warpdrive start’ from the ‘CMD’.\n\nThe easier path though would be to use Docker base images which I have created which already incorporate all the required base packages and integrate ‘warpdrive’ already.\n\nHaving to create Docker images yourself can still be a pain though, especially when doing it from scratch and you aren’t aware of all the traps and pitfalls in doing that.\n\nTo make it all easier, ‘warpdrive’ and the Docker base images I have are S2I enabled.\n\nMost probably wouldn’t have heard of S2I, but what it stands for is ’Source to Image’. It is effectively the concept of build packs as implemented by some hosting services, but re-imagined and modernised to use Docker.\n\nYou can read more about Source to Image at:\n\n  * <https://github.com/openshift/source-to-image>\n\n\n\nHaving already shown that my Django web application runs, all I now need to do to create a Docker image for it is to run ‘warpdrive s2i’.\n\n```python\n    (warpdrive+mydjangosite) $ warpdrive s2i\n\n    ---> Installing application source  \n    ---> Building application from source  \n    -----> Installing dependencies with pip  \n    Collecting Django (from -r requirements.txt (line 1))  \n    Downloading Django-1.9.2-py2.py3-none-any.whl (6.6MB)  \n    Installing collected packages: Django  \n    Successfully installed Django-1.9.2  \n    -----> Collecting static files for Django  \n    Copying ‘.../django/contrib/admin/static/admin/img/icon-yes.svg’  \n    ...  \n    \n    56 static files copied to '/home/warpdrive/django_static_root'.  \n    ---> Fix permissions on application source\n\n    (warpdrive+mydjangosite) $ docker images | grep mydjangosite  \n    warpdrive-mydjangosite latest 8d7fd16f7ab8 20 seconds ago 819.6 MB\n```\n\nThe result of this is a Docker image incorporating my Django web application and all it needs, called ‘warpdrive-mydjangosite'. As before, ‘collectstatic’ was automatically run as part of the build phase for the Docker image.\n\nRunning the Docker image is then just a matter of executing ‘docker run’ and exposing the appropriate port.\n\n```python\n    (warpdrive+mydjangosite) $ docker run -p 8080:8080 warpdrive-mydjangosite  \n    ---> Executing the start up script  \n    -----> Configuring for server type of auto  \n    -----> Running server script start-mod_wsgi  \n    -----> Executing server command ' mod_wsgi-express start-server --log-to-terminal --startup-log --port 8080 --application-type module --entry-point mydjangosite.wsgi --callable-object application --url-alias /static/ /home/warpdrive/django_static_root/'  \n    [Thu Feb 18 03:08:22.406961 2016] [mpm_event:notice] [pid 19:tid 139789921310464] AH00489: Apache/2.4.18 (Unix) mod_wsgi/4.4.22 Python/2.7.11 configured -- resuming normal operations  \n    [Thu Feb 18 03:08:22.407345 2016] [core:notice] [pid 19:tid 139789921310464] AH00094: Command line: 'httpd (mod_wsgi-express) -f /tmp/mod_wsgi-localhost:8080:1001/httpd.conf -E /dev/stderr -D MOD_WSGI_MPM_ENABLE_EVENT_MODULE -D MOD_WSGI_MPM_EXISTS_EVENT_MODULE -D MOD_WSGI_MPM_EXISTS_WORKER_MODULE -D MOD_WSGI_MPM_EXISTS_PREFORK_MODULE -D FOREGROUND'\n```\n\nYou can then test further your web application running in the context of Docker and if happy, push the Docker image up to your hosting platform and run it.\n\n# Deploying to OpenShift 3\n\nIf using the latest version of OpenShift based on Docker and Kubernetes deployment is even easier. This is because you don’t need to go through the separate step yourself of creating the Docker image and uploading it to a Docker registry. This is because OpenShift itself is aware of Source to Image and can deploy web applications direct from a Git repository.\n\nTo deploy this same application to OpenShift, all I would need to do is commit my changes and push them up to my Git repository and run:\n\n```python\n    (warpdrive+mydjangosite) $ oc new-app grahamdumpleton/warp0-debian8-python27~https://github.com/GrahamDumpleton/django-hello-world-v1.git  \n    --> Found Docker image d148eec (8 hours old) from Docker Hub for \"grahamdumpleton/warp0-debian8-python27\"\n\n    Python 2.7 (Warp Drive)  \n    -----------------------  \n    S2I builder for Python web applications.\n\n    Tags: builder, python, python27, warpdrive, warpdrive-python27\n\n    * An image stream will be created as \"warp0-debian8-python27:latest\" that will track the source image  \n    * A source build using source code from https://github.com/GrahamDumpleton/django-hello-world-v1.git will be created  \n    * The resulting image will be pushed to image stream \"django-hello-world-v1:latest\"  \n    * Every time \"warp0-debian8-python27:latest\" changes a new build will be triggered  \n    * This image will be deployed in deployment config \"django-hello-world-v1\"  \n    * Port 8080/tcp will be load balanced by service \"django-hello-world-v1\"  \n    * Other containers can access this service through the hostname \"django-hello-world-v1\"\n\n    --> Creating resources with label app=django-hello-world-v1 ...  \n    imagestream \"django-hello-world-v1\" created  \n    buildconfig \"django-hello-world-v1\" created  \n    deploymentconfig \"django-hello-world-v1\" created  \n    service \"django-hello-world-v1\" created\n\n    (warpdrive+mydjangosite) $ oc expose service django-hello-world-v1  \n    route \"django-hello-world-v1\" exposed\n```\n\nOpenShift will automatically download my Docker base image with S2I support as necessary, and the Git repository containing my application source code, trigger the S2I build process to create the final Docker image and then deploy it. We then just need to run one final step to actually make the web application publicly accessible and we are done.\n\n# Alternate PaaS providers\n\nCould ‘warpdrive’ be used with other PaaS providers?\n\nThe answer there is yes, provided they don’t lock you out completely from the build and deployment phases, and don’t screw up the Python environment too much. I haven’t tweaked ‘warpdrive’ for this, and probably won't, but I have deployed previous iterations of all this work to OpenShift 2 and Heroku.\n\nThe end result is that we have the possibility here of having one deployment story that can work with multiple hosting services, but which can still also be used on your local development platform.\n\n# Alternate web servers\n\nIn our sample application we used Django, but if using an alternate WSGI framework you just need to supply a WSGI application entrypoint in a ‘wsgi.py’ file in the top directory of your project.\n\nBy default the ‘auto’ mode of ‘warpdrive’ will use ‘mod\\_wsgi-express’ to host any WSGI application, including Django specific applications. This is because ‘mod\\_wsgi-express’ was largely purpose built for this type of deployment setup. It is therefore the best option available.\n\nThe performance of most WSGI servers is more or less the same when configured properly. If you still wish to use a different WSGI server because the characteristics of that WSGI server better suit some unique requirement of your web application, you can still use that alternate WSGI server. To do this you just need to override the ‘auto’ mode and say what WSGI server you want to use.\n\nAlternate WSGI servers which are supported are ‘gunicorn’, ‘uwsgi’ and ‘waitress’. When these are selected you just need to ensure that they are also listed in the ‘requirements.txt’ file for ‘pip’. So long as you do that, ‘warpdrive’ will start up that WSGI server for you instead, supplying a minimal set of options required to get them to listen on the correct port for HTTP connections and log to the terminal. Any other required options to ensure the WSGI server behaves properly inside of a Docker container will also be supplied if necessary.\n\nAs well as specifying any of these alternate WSGI servers, you can also specify explicitly that ‘mod\\_wsgi’ should be used. Do be aware though that overriding the deployment mechanism and not using ‘auto’, means that the configuration of the WSGI server is then entirely up to you. So if specifying ‘mod\\_wsgi’ or an alternate WSGI server explicitly, you would then need to tell it how to host your Django application, whereas with ‘auto’ mode that is all done for you.\n\nFor those who don’t want to actually use a WSGI server, but instead for example want to use the Tornado web server, you can instead supply an ‘app.py’ file. If this file exists then that will take precedence and ‘warpdrive’ will execute it as a Python script to run your Python web application. Your web application then just needs to listen on the appropriate HTTP port.\n\nNeed even more control over startup, you can also supply an ‘app.sh’ file and so as necessary easily preform any last minute steps or set special environment variables. The only requirement at this point is that the final command in the shell script to run the actual web application use ‘exec’ so that the web application replaces the shell process. This is to ensure signals works properly when things are run under Docker. You might use an ‘app.sh’ file for example when wishing to setup and run Jupyter Notebook.\n\nSpecial knowledge for other Python web frameworks could also be added if they have a unique and commonly used method of deployment. For example, ‘warpdrive’ will also recognise a ‘paste.ini’ file as might be used by Paste based web applications and configure and launch ‘mod\\_wsgi-express’ to run it.\n\n# Should you use this?\n\nRight now ‘warpdrive’ is my play thing.\n\nBringing new Open Source projects into the open and making them public is a dangerous exercise due to the demands that users put on developers of the projects.\n\nSo right now you probably don’t want to use it because I still want the flexibility to make any sorts of changes I want to how it works. Plus I don’t really want hoards of users pestering me with simple questions.\n\nWill I ever say it is ready to use? Maybe, maybe not. That really depends on whether there is any interest. Surprisingly I have gotten a fait bit of push back from some quarters on this whole concept in the past. This may well be a vocal minority who think they already known how to do everything themselves, but such negative reactions aren’t always encouraging to the idea of declaring it public and usable.\n\nIf you are intrigued by what I have presented, think it has merit and might be something you would use, then at least follow me on Twitter \\(@GrahamDumpleton\\) and let me know on Twitter what you think. Thanks.",
  "date": "Thursday, February 18, 2016",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2016/02/building-better-user-experience-for.html",
  "post_id": "5247215794684207111",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "6311171993042776306",
      "author": "Vince",
      "author_url": "https://www.blogger.com/profile/05220559165606124447",
      "author_profile_id": "05220559165606124447",
      "content": "Hi \\! I'm looking forward to knowing more about this tool. Every tool you work on not only makes my software developer life easier, but helps me to understand underlying concepts, grab new techs, and help build python apps in isolation.  \n  \nKeep up :\\)",
      "timestamp": "February 25, 2016 at 1:26 AM",
      "permalink": "http://blog.dscpl.com.au/2016/02/building-better-user-experience-for.html?showComment=1456324004808#c6311171993042776306",
      "is_blog_author": false
    }
  ],
  "labels": [
    "apache",
    "django",
    "docker",
    "mod_wsgi",
    "openshift",
    "python",
    "s2i",
    "wsgi"
  ],
  "metadata": {
    "published_timestamp": "2016-02-18T15:45:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Building a better user experience for deploying Python web applications.",
    "og_title": "Building a better user experience for deploying Python web applications. ",
    "og_description": "Yet again I missed out on a getting a talk into PyCon US. The title of my proposed talk was the same as this blog post. Since it wasn’t acce...",
    "og_url": "http://blog.dscpl.com.au/2016/02/building-better-user-experience-for.html"
  },
  "downloaded_images": []
}