{
  "title": "More on those problems with example web2py configurations for mod_wsgi.",
  "content": "In the [last post](/posts/2009/08/problems-with-example-web2py/) about web2py I covered the problems with the HTTP configuration for using [mod\\_wsgi](http://www.modwsgi.org). This time will look at the combined HTTP/HTTPS configurations from the web2py book. The configuration in this case is as follows.\n    \n    \n    1  ### for requests on port 80  \n    2  NameVirtualHost *:80  \n    3  <VirtualHost *:80>  \n    4    ### set the servername  \n    5    ServerName example.com  \n    6    ### alias the location of applications (for static files)  \n    7    Alias / /home/web2py/applications/  \n    8    ### setup WSGI  \n    9    WSGIScriptAlias / /home/web2py/wsgihandler.py  \n    10   WSGIDaemonProcess web2py user=www-data group=www-data \\  \n    11     home=/home/web2py/ \\  \n    12     processes=10 maximum-requests=500  \n    13     ### admin requires SSL  \n    14   <Location \"/admin\">  \n    15     SSLRequireSSL  \n    16   </Location>  \n    17   ### appadmin requires SSL  \n    18   <LocationMatch \"ˆ(/[\\w_]*/appadmin/.*)\">  \n    19     SSLRequireSSL  \n    20   </LocationMatch>  \n    21   ### static files do not need WSGI  \n    22   <LocationMatch \"ˆ(/[\\w_]*/static/.*)\">  \n    23     Order Allow,Deny  \n    24     Allow from all  \n    25   </LocationMatch>  \n    26   ### everything else goes over WSGI  \n    27   <Location \"/\">  \n    28     Order deny,allow  \n    29     Allow from all  \n    30     WSGIProcessGroup web2py  \n    31   </Location>  \n    32   LogFormat \"%h %l %u %t \\\"%r\\\" %>s %b\" common  \n    33   CustomLog /var/log/apache2/access.log common  \n    34 </VirtualHost>  \n    35 ### for requests via SSL (port 443) enable SSL  \n    36 NameVirtualHost *:443  \n    37 <VirtualHost *:443>  \n    38   ServerName example.com  \n    39   Alias / /home/web2py/applications/  \n    40   WSGIScriptAlias / /home/web2py/wsgihandler.py  \n    41   WSGIDaemonProcess web2py user=www-data group=www-data \\  \n    42     home=/home/web2py/ \\  \n    43     processes=10 maximum-requests=500  \n    44   SSLEngine On  \n    45   SSLCertificateFile /etc/apache2/ssl/server.crt  \n    46   SSLCertificateKeyFile /etc/apache2/ssl/server.key  \n    47   <LocationMatch \"ˆ(/[\\w_]*/static/.*)\">  \n    48     Order Allow,Deny  \n    49     Allow from all  \n    50   </Location>  \n    51   <Location \"/\">  \n    52     Order deny,allow  \n    53     Allow from all  \n    54     WSGIProcessGroup web2py  \n    55   </Location>>  \n    56   LogFormat \"%h %l %u %t \\\"%r\\\" %>s %b\" common  \n    57   CustomLog /var/log/apache2/access.log common  \n    58 </VirtualHost> \n\nAs already stated in the last post, this has all the same problems as for the HTTP only configuration. Because a separate VirtualHost is used for HTTP and HTTPS, the problems are actually duplicated and occur in each VirtualHost. I will not cover all that again, so ensure you read the [last post](/posts/2009/08/problems-with-example-web2py/).\n\n  \n\n\nOn top of those problems, the HTTPS configuration contains an additional mistake, this time in how mod\\_wsgi is used.\n\n  \n\n\nThe mistake here is having a second WSGIDaemonProcess directive at line 41. Doing this will fail because the same daemon process group name of 'web2py' was used as the first argument to the directive, as was used in the WSGIDaemonProcess directive at line 10. The mod\\_wsgi module will reject this, as the names for daemon process groups must be unique no matter what context they are placed in.\n\n  \n\n\nThe first thought might be just to change the name as well as the reference to it in the WSGIProcessGroup directive at line 54. Although this will work, it does mean you then have a second daemon process group containing another 10 processes just for handling the HTTPS requests. As I already explained, the number of processes/threads was excessive and doing that would just make the problem twice as bad.\n\n  \n\n\nWhat one really wants is for both HTTP and HTTPS requests to use the same daemon process group. There are two ways one could achieve this.\n\n  \n\n\nThe first is to delete the WSGIDaemonProcess directive at line 41 and move the WSGIDaemonProcess directive at line 10 outside of both VirtualHost definitions. In other words, it is placed at global scope within the Apache configuration. By doing this, WSGI applications within any VirtualHost, regardless of ServerName, could be delegated to that daemon process group.\n\n  \n\n\nIf this your own system and you aren't hosting sites for other users, doing it this way is likely acceptable. If you want a slightly more secure configuration, you should still delete the WSGIDaemonProcess directive at line 41, but leave that at line 10 in place.\n\n  \n\n\nWhat is being relied upon in that case is that mod\\_wsgi will allow you to reference using the WSGIProcessGroup directive, a daemon process group specified in the context of another VirtualHost, so long as the ServerName for the VirtualHost is the same.\n\n  \n\n\nThis is a bit safer, because having the WSGIDaemonProcess directive within the VirtualHost means you can't accidentally delegate a WSGI application to it from a VirtualHost for a different ServerName set up for a different user.\n\n  \n\n\nWhich ever of the two methods is used, there is another subtlety at play in what is happening that is important to point out. This is that by default mod\\_wsgi will separate WSGI applications such that they run in distinct sub interpreters of the process they run in. The name of the sub interpreter is derived from ServerName, the port for the VirtualHost and the mount point of the application.\n\n  \n\n\nNormally this rule for deriving the name of the sub interpreter would actually mean that since HTTP and HTTPS connections are received on different ports, that there would still be two instances of the WSGI application in each process and thus twice as much memory used. Because though ports 80 and 443 are generally paired together for a site, mod\\_wsgi makes an exception in this case and will actually assign requests for the WSGI application through either port to run in the same sub interpreter. Thus, only one instance of the application in each process.\n\n  \n\n\nIf for some reason this was a big issue, then you could go back to using two distinctly named daemon process groups. Alternatively, you could use the WSGIApplicationGroup directive to control the name of the sub interpreter each is assigned to. This would see them run together in the same process, but in different sub interpreters with names you designate.\n\n  \n\n\nSo, that is it for the problems with the configuration that is doing the rounds for web2py and mod\\_wsgi. In summary, it will not work. Even if you drop the Alias directive so the web2py application receives requests, the use of Location and LocationMatch to control access to URLs is dangerous. On top of that, for the combined HTTP/HTTPS configuration, Apache wouldn't have even started up as mod\\_wsgi would have complained about the daemon process group names not being unique.\n\n  \n\n\nI'll give details of a working configuration for running web2py on top of mod\\_wsgi later when I get some more time.",
  "date": "Friday, August 21, 2009",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2009/08/more-on-those-problems-with-example.html",
  "post_id": "216198985569117188",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "6914815623292298920",
      "author": "Max",
      "author_url": "https://www.blogger.com/profile/09623275440139063403",
      "author_profile_id": "09623275440139063403",
      "content": "A new web2py book is out. The new book contains a revised version of the script written by Graham. Thank you Graham.",
      "timestamp": "August 30, 2009 at 12:06 AM",
      "permalink": "http://blog.dscpl.com.au/2009/08/more-on-those-problems-with-example.html?showComment=1251554800487#c6914815623292298920",
      "is_blog_author": false
    },
    {
      "comment_id": "2935141011732658670",
      "author": "Javi",
      "author_url": "https://www.blogger.com/profile/01464904072113806488",
      "author_profile_id": "01464904072113806488",
      "content": "Many thanks, this solved my problem installing web2py in production with SSL. You are so generous sharing your knowledge. Thanks Thanks and Thanks...",
      "timestamp": "June 25, 2012 at 6:53 PM",
      "permalink": "http://blog.dscpl.com.au/2009/08/more-on-those-problems-with-example.html?showComment=1340614403412#c2935141011732658670",
      "is_blog_author": false
    }
  ],
  "labels": [
    "mod_wsgi",
    "python",
    "web2py"
  ],
  "metadata": {
    "published_timestamp": "2009-08-21T20:39:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: More on those problems with example web2py configurations for mod_wsgi.",
    "og_title": "More on those problems with example web2py configurations for mod_wsgi.",
    "og_description": "In the last post  about web2py I covered the problems with the HTTP configuration for using mod_wsgi . This time will look at the combined H...",
    "og_url": "http://blog.dscpl.com.au/2009/08/more-on-those-problems-with-example.html"
  },
  "downloaded_images": []
}