{
  "title": "Unknown user when running Docker container.",
  "content": "In the [last post](/posts/2015/12/random-user-ids-when-running-docker/) we covered how to setup a Docker image to cope with the prospect of a random user ID being used when the Docker container was started. The discussion so far has though only dealt with the issue of ensuring file system access permissions were set correctly to allow the original default user, as well as the random user ID being used, to update files.\n\nA remaining issue of concern was the fact that when a random user ID is used which doesn’t correspond to an actual user account, that UNIX tools such as ‘whoami’ will not return valid results.\n\n```\n I have no name!@5a72c002aefb:/notebooks$ whoami  \n whoami: cannot find name for user ID 10000\n```\n\nUp to this point this didn’t actually appear to prevent our IPython Notebook application working, but it does leave the prospect that subtle problems could arise when we start actually using IPython to do more serious work.\n\nLets dig in and see what this failure equates to in the context of a Python application.\n\n# Accessing user information\n\nIf we are writing Python code, there are a couple of ways using the Python standard library that we could determine the login name for the current user.\n\nThe first way is to use the ‘getuser\\(\\)’ function found in the ‘getpass’ module.\n\n```\n import getpass  \n name = getpass.getuser()\n```\n\nIf we use this from an IPython notebook when a random user ID has been assigned to the Docker container, like how ‘whoami’ fails, this will also fail.\n\n```\n ---------------------------------------------------------------------------  \n KeyError                                  Traceback (most recent call last)  \n <ipython-input-3-3a0a5fbe1d4e> in <module>()  \n       1 import getpass  \n ----> 2 name = getpass.getuser()\n \n \n /usr/lib/python2.7/getpass.pyc in getuser()  \n     156 # If this fails, the exception will \"explain\" why  \n     157 import pwd  \n --> 158 return pwd.getpwuid(os.getuid())[0]  \n     159   \n     160 # Bind the name getpass to the appropriate function\n \n \n KeyError: 'getpwuid(): uid not found: 10000'\n```\n\nThe error details and traceback displayed here actually indicate the second way of getting access to the login name. In fact the ‘getuser\\(\\)’ function is just a high level wrapper around a lower level function for accessing user information from the system user database.\n\nWe could therefore also have written:\n\n```\n import pwd, os  \n name = pwd.getpwuid(os.getuid())[0]\n```\n\nOr being more verbose to make it more obvious what is going on:\n\n```\n import pwd, os  \n name = pwd.getpwuid(os.getuid()).pw_name\n```\n\nEither way, this is still going to fail where the current user ID doesn’t match a valid user in the system user database.\n\n# Environment variable overrides\n\nYou may be thinking, why bother with the ‘getuser\\(\\)’ function if one could use ‘pwd.getpwuid\\(\\)’ directly. Well it turns out that ‘getuser\\(\\)’ does a bit more than just act as a proxy for calling ‘pwd.getpwuid\\(\\)’. What it actually does is first consult various environment variables which identify the login name for the current user.\n\n```\n def getuser():  \n     \"\"\"Get the username from the environment or password database.\n \n \n     First try various environment variables, then the password  \n     database. This works on Windows as long as USERNAME is set.\n \n \n     \"\"\"\n \n \n     import os\n \n \n     for name in ('LOGNAME', 'USER', 'LNAME', 'USERNAME'):  \n         user = os.environ.get(name)  \n         if user:  \n             return user\n \n \n     # If this fails, the exception will \"explain\" why  \n     import pwd  \n     return pwd.getpwuid(os.getuid())[0]\n```\n\nThese environment variables such as ‘LOGNAME’ and ‘USER’ would normally be set by the login shell for a user. When using Docker though, a login shell isn’t used and so they are not set.\n\nFor the ‘getuser\\(\\)’ function at least, we can therefore get it working by ensuring that as part of the Docker image build, we set one or more of these environment variables. Typically both the ‘LOGNAME’ and ‘USER’ environment variables are set, so lets do that.\n\n```\n ENV LOGNAME=ipython  \n ENV USER=ipython \n```\n\nRebuilding our Docker image with this addition to the ‘Dockerfile’ and trying ‘getuser\\(\\)’ again from within a IPython Notebook and it does indeed now work.\n\n# Overriding user system wide\n\nThis change may help allow more code to execute without problems, but if code directly accesses the system user database using ‘pwd.getpwuid\\(\\)’, if it doesn’t catch the ‘KeyError’ exception and handle missing user information you will still have problems.\n\nSo although this is still a worthwhile change in its own right, just in case something may want to consult ‘LOGNAME’ and ‘USER’ environment variables which would normally be set by the login shell, such as ‘getuser\\(\\)’, it does not help with ‘pwd.getpwuid\\(\\)’ nor UNIX tools such as ‘whoami’.\n\nTo be able to implement a solution for this wider use case gets a bit more tricky as we need to solve the issue for UNIX tools, or for that matter, any C level application code which uses the ‘getpwuid\\(\\)’ function in the system C libraries.\n\nThe only way one can achieve this though is through substituting the system C libraries, or at least overriding the behaviour of key C library functions. This may sound impossible but by using a Linux capability to forcibly preload a shared library into executing processes it is actually possible and someone has even written a package we can use for this purpose.\n\n# The nss\\_wrapper library\n\nThe package in question is one called ‘[nss\\_wrapper](https://cwrap.org/nss_wrapper.html)'. The library provides a wrapper for the user, group and hosts NSS API. Using nss\\_wrapper it is possible to define your own ‘passwd' and ‘group' files which will then be consulted when needing to lookup user information.\n\nOne way in which this package is normally used is when doing testing and you need to run applications using a dynamic set of users and you don’t want to have to create real user accounts for them. This mirrors the situation we have where when using a random user ID we will not actually have a real user account.\n\nThe idea behind the library is that prior to starting up your application you would make copies of the system user and group database files and then edit any existing entries or add additional users as necessary. When starting your application you would then force it to preload a shared library which overrides the NSS API functions in the standard system libraries such that they consult the copies of the user and group database files.\n\nThe general steps therefore are something like:\n\n```\n ipython@3d0c5ea773a3:/tmp$ whoami  \n ipython\n \n \n ipython@3d0c5ea773a3:/tmp$ id  \n uid=1001(ipython) gid=0(root) groups=0(root)\n \n \n ipython@3d0c5ea773a3:/tmp$ echo \"magic:x:1001:0:magic gecos:/home/ipython:/bin/bash\" > passwd\n \n \n ipython@3d0c5ea773a3:/tmp$ LD_PRELOAD=/usr/local/lib64/libnss_wrapper.so NSS_WRAPPER_PASSWD=passwd NSS_WRAPPER_GROUP=/etc/group id  \n uid=1001(magic) gid=0(root) groups=0(root)\n \n \n ipython@3d0c5ea773a3:/tmp$ LD_PRELOAD=/usr/local/lib64/libnss_wrapper.so NSS_WRAPPER_PASSWD=passwd NSS_WRAPPER_GROUP=/etc/group whoami  \n magic\n```\n\nTo integrate the use of the ‘nss\\_wrapper’ package we need to do two things. The first is install the package and the second is to add a Docker entrypoint script which can generate a modified password database file and then ensure that the ‘libnss\\_wrapper.so’ shared library is forcibly preloaded for all processes subsequently run.\n\n# Installing the nss\\_wrapper library\n\nAt this point in time the ‘nss\\_wrapper’ library is not available in the stable Debian package repository, still only being available in the testing repository. As we do not want in general to be pulling packages from the Debian testing repository, we are going to have to install the ’nss\\_wrapper’ library from source code ourselves.\n\nTo be able to do this, we need to ensure that the system packages for ‘make’ and ‘cmake’ are available. We therefore need to add these to the list of system packages being installed.\n\n```\n # Python binary and source dependencies  \n RUN apt-get update -qq && \\  \n  DEBIAN_FRONTEND=noninteractive apt-get install -yq --no-install-recommends \\  \n  build-essential \\  \n  ca-certificates \\  \n  cmake \\  \n  curl \\  \n  git \\  \n  make \\  \n  language-pack-en \\  \n  libcurl4-openssl-dev \\  \n  libffi-dev \\  \n  libsqlite3-dev \\  \n  libzmq3-dev \\  \n  pandoc \\  \n  python \\  \n  python3 \\  \n  python-dev \\  \n  python3-dev \\  \n  sqlite3 \\  \n  texlive-fonts-recommended \\  \n  texlive-latex-base \\  \n  texlive-latex-extra \\  \n  zlib1g-dev && \\  \n  apt-get clean && \\  \n  rm -rf /var/lib/apt/lists/*\n```\n\nWe can then later on download the source package for ‘nss\\_wrapper’ and install it.\n\n```\n # Install nss_wrapper.  \n RUN curl -SL -o nss_wrapper.tar.gz https://ftp.samba.org/pub/cwrap/nss_wrapper-1.1.2.tar.gz && \\  \n  mkdir nss_wrapper && \\  \n  tar -xC nss_wrapper --strip-components=1 -f nss_wrapper.tar.gz && \\  \n  rm nss_wrapper.tar.gz && \\  \n  mkdir nss_wrapper/obj && \\  \n  (cd nss_wrapper/obj && \\  \n  cmake -DCMAKE_INSTALL_PREFIX=/usr/local -DLIB_SUFFIX=64 .. && \\  \n  make && \\  \n  make install) && \\  \n  rm -rf nss_wrapper\n```\n\n# Updating the Docker entrypoint\n\nAt present the Docker ‘ENTRYPOINT’ and ‘CMD’ are specified in the ‘Dockerfile’ as:\n\n```\n ENTRYPOINT [“tini”, “--\"]  \n CMD [\"jupyter\", \"notebook\"]\n```\n\nThe ‘CMD’ statement in this case is the actual command we want to run to start the Jupyter Notebook application.\n\nWe haven’t said anything about what the ‘tini’ program specified by the ‘ENTRYPOINT' is all about as yet, but it is actually quite important. If you do not use ‘tini’ as a wrapper for IPython Notebook then it will not work properly. We will cover what ‘tini’ is and why it is necessary for running IPython Notebook in a subsequent post.\n\nNow because we do require ‘tini’, but we now also want to do some other work prior to actually running the ‘jupyter notebook’ command, we are going to substitute an entrypoint script in place of ‘tini’. We will call this ‘entrypoint.sh’, make it executable, and place it in the top level directory of the repository. After its copied into place, the ‘ENTRYPOINT’ specified in the ‘Dockerfile’ will then need to be:\n\n```\n ENTRYPOINT [\"/usr/src/jupyter-notebook/entrypoint.sh\"]\n```\n\nThe actual ‘entrypoint.sh’ we will specify as:\n\n```\n #!/bin/sh\n \n \n # Override user ID lookup to cope with being randomly assigned IDs using  \n # the -u option to 'docker run'.\n \n \n USER_ID=$(id -u)\n \n \n if [ x\"$USER_ID\" != x\"0\" -a x\"$USER_ID\" != x\"1001\" ]; then  \n     NSS_WRAPPER_PASSWD=/tmp/passwd.nss_wrapper  \n     NSS_WRAPPER_GROUP=/etc/group\n \n \n     cat /etc/passwd | sed -e ’s/^ipython:/builder:/' > $NSS_WRAPPER_PASSWD\n \n \n     echo \"ipython:x:$USER_ID:0:IPython,,,:/home/ipython:/bin/bash\" >> $NSS_WRAPPER_PASSWD\n \n \n     export NSS_WRAPPER_PASSWD  \n     export NSS_WRAPPER_GROUP\n \n \n     LD_PRELOAD=/usr/local/lib64/libnss_wrapper.so  \n     export LD_PRELOAD  \n fi\n \n \n exec tini -- \"$@\"\n```\n\nNote that we still execute ‘tini’ as the last step. We do this using ‘exec’ so that its process will replace the entrypoint script and take over as process ID 1, ensuring that signals get propagated properly, as well as to ensure some details related to process management are handled correctly. We will also pass on all command line arguments given to the entrypoint script to ‘tini’. The double quotes around the arguments reference ensure that argument quoting is handled properly when passing through arguments.\n\nWhat is now new compared to what was being done before is the enabling of the ‘nss\\_wrapper’ library. We do not do this though when we are running as ‘root’, were that is that the Docker image was still forced to run as ‘root’ even though the aim is that it run as a non ‘root’ user. We also do not need to do it when we are run with the default user ID.\n\nWhen run as a random user ID we do two things with the password database file that we will use with ‘nss\\_wrapper’.\n\nThe first is that we change the login name corresponding to the existing user ID of ‘1001’. This is the default ‘ipython’ user account we created previously. We do this by simply replacing the ‘ipython’ login name in the password file when we copy it, with the name ‘builder’ instead.\n\nThe second is that we add a new password database file entry corresponding to the current user ID, that being whatever is the random user ID allocated to run the Docker container. In this case we use the login name of ‘ipython’.\n\nThe reason for swapping the login names so the current user ID uses ‘ipython’ rather than the original user ID of ‘1001’, is so that the application when run will still think it is the ‘ipython’ user. What we therefore end up with in our copy of the password database file is:\n\n```\n docker run -it --rm -u 10000 -p 8888:8888 jupyter-notebook bash  \n ipython@0ff73693d433:/notebooks$ tail -2 /tmp/passwd.nss_wrapper  \n builder:x:1001:0:IPython,,,:/home/ipython:/bin/bash  \n ipython:x:10000:0:IPython,,,:/home/ipython:/bin/bash\n```\n\nImmediately you can already see that the shell prompt now looks correct. Going back and running our checks from before, we now see:\n\n```\n ipython@0ff73693d433:/notebooks$ whoami  \n ipython  \n ipython@0ff73693d433:/notebooks$ id  \n uid=10000(ipython) gid=0(root) groups=0(root)  \n ipython@0ff73693d433:/notebooks$ env | grep HOME  \n HOME=/home/ipython  \n ipython@0ff73693d433:/notebooks$ touch $HOME/magic  \n ipython@0ff73693d433:/notebooks$ touch /notebooks/magic  \n ipython@0ff73693d433:/notebooks$ ls -las $HOME  \n total 24  \n 4 drwxrwxr-x 4 builder root 4096 Dec 24 10:22 .  \n 4 drwxr-xr-x 6 root root 4096 Dec 24 10:22 ..  \n 4 -rw-rw-r-- 1 builder root 220 Dec 24 10:08 .bash_logout  \n 4 -rw-rw-r-- 1 builder root 3637 Dec 24 10:08 .bashrc  \n 4 drwxrwxr-x 2 builder root 4096 Dec 24 10:08 .jupyter  \n 0 -rw-r--r-- 1 ipython root 0 Dec 24 10:22 magic  \n 4 -rw-rw-r-- 1 builder root 675 Dec 24 10:08 .profile\n```\n\nSo even though the random user ID didn’t have an entry in the original system password database file, by using ‘nss\\_wrapper’ we can trick any applications to use our modified password database file for user information. This means we can dynamically generate a valid password database file entry for the random user ID which was used.\n\nWith the way we swapped the login name for the default user ID of ‘1001’, with the random user ID, as far as any application is concerned it is still running as the ‘ipython’ user.\n\nSo we can distinguish, any files that were created during the image build as the original ‘ipython’ user will now instead show as being owned by ‘builder’, which if we look it up maps to user ID of ‘1001’.\n\n```\n ipython@0ff73693d433:/notebooks$ id builder  \n uid=1001(builder) gid=0(root) groups=0(root)  \n ipython@0ff73693d433:/notebooks$ getent passwd builder  \n builder:x:1001:0:IPython,,,:/home/ipython:/bin/bash\n```\n\n# Running as another name user\n\nNot that there strictly should be a reason for doing so, but it is possible to also force the Docker container to run as some other user ID with an entry in the password database file, but because they have their own distinct primary group assignments, you do have to override the group to be ‘0’ so that it can update any required directories.\n\n```\n $ docker run -it --rm -u 5 -p 8888:8888 jupyter-notebook bash  \n games@36ec17b1d9c1:/notebooks$ whoami  \n games  \n games@36ec17b1d9c1:/notebooks$ id  \n uid=5(games) gid=60(games) groups=60(games)  \n games@36ec17b1d9c1:/notebooks$ env | grep HOME  \n HOME=/home/ipython  \n games@36ec17b1d9c1:/notebooks$ touch $HOME/magic  \n touch: cannot touch ‘/home/ipython/magic’: Permission denied  \n games@36ec17b1d9c1:/notebooks$ touch /notebooks/magic  \n touch: cannot touch ‘/notebooks/magic’: Permission denied  \n   \n $ docker run -it --rm -u 5:0 -p 8888:8888 jupyter-notebook bash  \n games@e2ecabedab47:/notebooks$ whoami  \n games  \n games@e2ecabedab47:/notebooks$ id  \n uid=5(games) gid=0(root) groups=60(games)  \n games@e2ecabedab47:/notebooks$ env | grep HOME  \n HOME=/home/ipython  \n games@e2ecabedab47:/notebooks$ touch $HOME/magic  \n games@e2ecabedab47:/notebooks$ touch /notebooks/magic  \n games@e2ecabedab47:/notebooks$ ls -las $HOME  \n total 24  \n 4 drwxrwxr-x 4 builder root 4096 Dec 24 10:41 .  \n 4 drwxr-xr-x 6 root root 4096 Dec 24 10:41 ..  \n 4 -rw-rw-r-- 1 builder root 220 Dec 24 10:39 .bash_logout  \n 4 -rw-rw-r-- 1 builder root 3637 Dec 24 10:39 .bashrc  \n 4 drwxrwxr-x 2 builder root 4096 Dec 24 10:39 .jupyter  \n 0 -rw-r--r-- 1 games root 0 Dec 24 10:41 magic  \n 4 -rw-rw-r-- 1 builder root 675 Dec 24 10:39 .profile\n```\n\n# Running as process ID 1\n\nFinally if we startup the IPython Notebook application localy with Docker, or on OpenShift, then everything still works okay. Further, as well as the ‘getpass.getuser\\(\\)’ function working, use of ‘pwd.getpwuid\\(os.getuid\\(\\)\\)’ also works, this being due to the use of the ‘nss\\_wrapper’ library.\n\nSo everything is now good and we shouldn’t have any issues. There was though something already present in the way that the ‘jupiter/notebook’ Docker image was set up that is worth looking at. This was the use of the ‘tini’ program as the ‘ENTRYPOINT’ in the ‘Dockerfile’. This relates to problems that can arise when running an application as process ID 1. I will look at what this is all about in the next post.",
  "date": "2015-12-24",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2015/12/unknown-user-when-running-docker.html",
  "post_id": "6613553346694572403",
  "blog_id": "2363643920942057324",
  "comments": [
    {
      "comment_id": "2313675885316228202",
      "author": "Nadia",
      "author_url": "https://www.blogger.com/profile/11439432761303063591",
      "author_profile_id": "11439432761303063591",
      "content": "Hello Graham\\!  \nThanks for a great article\\!   \nI'm trying to use this \"hack\" to run a container with jenkins. I use official jenkins image \\(FROM jenkins/jenkins:lts\\), the nss\\_wrapper is installed with no problem, but how to configure entrypoint in this case?   \nThanks,  \nNadia",
      "timestamp": "March 22, 2018 at 5:43 AM",
      "permalink": "http://blog.dscpl.com.au/2015/12/unknown-user-when-running-docker.html?showComment=1521657787725#c2313675885316228202",
      "is_blog_author": false
    },
    {
      "comment_id": "6368479899493036677",
      "author": "Graham Dumpleton",
      "author_url": "https://www.blogger.com/profile/13609779138164842374",
      "author_profile_id": "13609779138164842374",
      "content": "I wouldn't use nss\\_wrapper now. It is easier to make /etc/passwd and /etc/group files writable to group root. Then in entry point script add entries directly to the files such as is done in:  \n  \nhttps://github.com/jupyter/docker-stacks/blob/master/base-notebook/start.sh\\#L70  \n  \nThis is much simpler than mucking around with the shared libraries.  \n  \nUpdating the passwd file is even recommended way in OpenShift docs now. See 'Support arbitrary user IDs' in:  \n  \nhttps://docs.openshift.org/latest/creating\\_images/guidelines.html",
      "timestamp": "March 22, 2018 at 9:54 AM",
      "permalink": "http://blog.dscpl.com.au/2015/12/unknown-user-when-running-docker.html?showComment=1521672883649#c6368479899493036677",
      "is_blog_author": true
    },
    {
      "comment_id": "1349642307144636107",
      "author": "Nadia",
      "author_url": "https://www.blogger.com/profile/11439432761303063591",
      "author_profile_id": "11439432761303063591",
      "content": "Thanks a lot for a reference, it helps me to configure my container.   \nI use this example: https://github.com/RHsyseng/container-rhel-examples/blob/master/starter-arbitrary-uid/Dockerfile.centos7 and it works perfect.",
      "timestamp": "March 27, 2018 at 1:09 AM",
      "permalink": "http://blog.dscpl.com.au/2015/12/unknown-user-when-running-docker.html?showComment=1522073380037#c1349642307144636107",
      "is_blog_author": false
    }
  ],
  "labels": [
    "docker",
    "ipython",
    "openshift",
    "python"
  ],
  "metadata": {
    "published_timestamp": "2015-12-24T22:19:00+11:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Unknown user when running Docker container.",
    "og_title": "Unknown user when running Docker container.",
    "og_description": "In the last post  we covered how to setup a Docker image to cope with the prospect of a random user ID being used when the Docker container ...",
    "og_url": "http://blog.dscpl.com.au/2015/12/unknown-user-when-running-docker.html"
  },
  "downloaded_images": []
}