{
  "title": "Reporting on the DjangoCon US 2014 hallway track.",
  "content": "I have only been in Portland for a few hours for DjangoCon, and despite some lack of sleep, I already feel that being here is recharging my enthusiasm for working on Open Source, something that has still been sagging a bit lately. I don't wish to return to that dark abyss I was in, so definitely what I need.\n\nNow lots of people write up reports on conferences including live noting them, but I thought I might see if I can manage something a bit different for DjangoCon US this year. That is, rather than simply live note about the talks or give a general round up of how I felt about the conference, I am going to try and do some quick fire blog posts on specific topics that have come up in discussions with others in the hallways or during social drinks.\n\nEven during the first evenings drinks graciously hosted by Steve Holden, a whole bunch of topics related to mod\\_wsgi came up. In most cases these resolved around where someone was experiencing a pain point over how to do something, but where my response was, \"oh, there is a better way of doing that\".\n\nI will therefore endeavour to write up some mini blog posts on the topics that come up and expand on them as I can.\n\nSince the hallway track can can be a learning experience in itself, I thought this might be of interest to others as well.\n\nAnd if you are at DjangoCon, do make sure you make good use of the hallway track. Reach out and talk to people you don't know. Hunt down those experts who might be able to help you with a specific problem. Such discussions need not be one way and I know I learn lots about how people use mod\\_wsgi from such conversations.\n\nIf you do want to specifically get hold of me, you will find I will not be there on all days. I will at least be there on the first day of talks and for the sprints. I also aim to get to anything happening in the evenings. See you there.",
  "date": "2014-09-01",
  "author": "Graham Dumpleton",
  "url": "http://blog.dscpl.com.au/2014/09/reporting-on-djangocon-us-2014-hallway.html",
  "post_id": "8030597752797605609",
  "blog_id": "2363643920942057324",
  "comments": [],
  "labels": [
    "django",
    "python"
  ],
  "metadata": {
    "published_timestamp": "2014-09-01T14:34:00+10:00",
    "blog_title": "Graham Dumpleton",
    "page_title": "Graham Dumpleton: Reporting on the DjangoCon US 2014 hallway track.",
    "og_title": "Reporting on the DjangoCon US 2014 hallway track.",
    "og_description": "I have only been in Portland for a few hours for DjangoCon, and despite some lack of sleep, I already feel that being here is recharging my ...",
    "og_url": "http://blog.dscpl.com.au/2014/09/reporting-on-djangocon-us-2014-hallway.html"
  },
  "downloaded_images": []
}